{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031951/", "name": "Son of Frankenstein", "image": "https://m.media-amazon.com/images/M/MV5BOTljNTRiZjYtM2Y2Yi00MWUxLWI5MjEtYjlhZDVhZjg2ZmYyL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Drama", "Horror", "Sci-Fi"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0000472/", "name": "Boris Karloff"}, {"@type": "Person", "url": "/name/nm0001651/", "name": "Basil Rathbone"}, {"@type": "Person", "url": "/name/nm0000509/", "name": "Bela Lugosi"}, {"@type": "Person", "url": "/name/nm0041172/", "name": "Lionel Atwill"}], "director": {"@type": "Person", "url": "/name/nm0498174/", "name": "Rowland V. Lee"}, "creator": [{"@type": "Person", "url": "/name/nm0791217/", "name": "Mary Shelley"}, {"@type": "Person", "url": "/name/nm0178459/", "name": "Wyllis Cooper"}, {"@type": "Organization", "url": "/company/co0005073/"}], "description": "Son of Frankenstein is a movie starring Boris Karloff, Basil Rathbone, and Bela Lugosi. Returning to the ancestral castle long after the death of the monster, the son of Dr. Frankenstein meets a mad shepherd who is hiding the...", "datePublished": "1939-01-13", "keywords": "sequel,shot to death,scientist,castle,broken neck", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 9052, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031951/"}, "author": {"@type": "Person", "name": "bensonmum2"}, "dateCreated": "2005-10-04", "inLanguage": "English", "name": "\"One doesn't easily forget, Herr Baron, an arm torn out by the roots.\"", "reviewBody": "When Baron Wolf von Frankenstein (Basil Rathbone) arrives to take over his father's estate, the locals immediately begin to fear for the worst. Wolf's father created a monster that terrorized the community and the townsfolk want no more of that. Wolf assures everyone that he has no intentions of creating a monster. But when Wolf finds Ygor (Bela Lugosi) living in the ruins of his father's laboratory, he is soon headed down the same path of destruction that claimed his father.\n\nOver the years, there have been volumes written on the Universal classic horror movies. Realizing that it would be foolish of me to attempt to improve or add much to the writings of these scholars, I'll instead focus on a couple of areas that make Son of Frankenstein so special to me.\n\n1. The Acting. Son of Frankenstein features a Who's Who of the best of the classic horror actors. Joining Rathbone and Lugosi in the cast are Boris Karloff and Lionel Atwill. While each gives a noteworthy performance in their own right, Lugosi's performance is generally held up as the best of his career. And while I agree, Rathbone makes Son of Frankenstein a joy for me to watch. There are very few actors that I can think of who could have played Wolf with the same type of intelligent energy that Rathbone exhibits. He's wonderful. As for Karloff, I'm glad he decided to make Son of Frankenstein his last as the monster. By the time of the second sequel, Karloff's monster became little more that a prop for Lugosi, Rathbone, and Atwill to fight over.\n\n2. The Sets. I'm not exaggerating when I say that the sets in Son of Frankenstein are among the best I've ever seen. The sets are amazing with their bizarre angles and shadows. Two that immediately come to mind are the dining table set and the staircase set at the beginning of the movie. They are in a class of their own.\n\nEvery fan of horror, or just good classic movies in general, owes it to themselves to see Son of Frankenstein. It may not be as well known among the casual fan as either Frankenstein or Bride of Frankenstein, but it many ways it's the equal of those two films (if not better).", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H39M", "trailer": {"@type": "VideoObject", "name": "Trailer", "embedUrl": "/video/imdb/vi1869594393", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTA4NDIxZTYtYjYxOC00OTAyLTk5NWMtODQ2NWNlNzMzMGNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTA4NDIxZTYtYjYxOC00OTAyLTk5NWMtODQ2NWNlNzMzMGNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-01-28T19:08:38Z"}}