{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031972/", "name": "Stand Up and Fight", "image": "https://m.media-amazon.com/images/M/MV5BMTUxMTkxMTUyOV5BMl5BanBnXkFtZTgwNjY1MDc1NTE@._V1_.jpg", "genre": ["Drama", "History", "Romance", "Western"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0000891/", "name": "Wallace Beery"}, {"@type": "Person", "url": "/name/nm0001791/", "name": "Robert Taylor"}, {"@type": "Person", "url": "/name/nm0723422/", "name": "Florence Rice"}, {"@type": "Person", "url": "/name/nm0110813/", "name": "Helen Broderick"}], "director": {"@type": "Person", "url": "/name/nm0886754/", "name": "W.S. Van Dyke"}, "creator": [{"@type": "Person", "url": "/name/nm0128906/", "name": "James M. Cain"}, {"@type": "Person", "url": "/name/nm0613848/", "name": "Jane Murfin"}, {"@type": "Person", "url": "/name/nm0272646/", "name": "Harvey Fergusson"}, {"@type": "Person", "url": "/name/nm0662751/", "name": "Forbes Parkhill"}, {"@type": "Person", "url": "/name/nm0821716/", "name": "Laurence Stallings"}, {"@type": "Organization", "url": "/company/co0007143/"}], "description": "Stand Up and Fight is a movie starring Wallace Beery, Robert Taylor, and Florence Rice. It starts in 1844 in Maryland, where Robert Taylor, plantation owner with slaves, is forced by debts to sell his estate and his people. Then he...", "datePublished": "1939-01-06", "keywords": "horse,pistol,deception,rivalry,businessman", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 273, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031972/"}, "author": {"@type": "Person", "name": "MartinHafer"}, "dateCreated": "2010-04-11", "inLanguage": "English", "name": "Not bad....but also a bit strange.", "reviewBody": "Before I start, I would like to point out that the film was set in 1844 and practically everyone uses revolvers--even though this sort of gun was super-rare at that time. Revolvers would become more common in the 1850s-1860, but in 1844 you just didn't see them because they were so new. Yet, oddly, EVERYBODY seems to have one in the shootout near the end of the film! The revolver was NOT a reliable weapon and few could afford them if they could even find one back then! Oh, well, there are worse historical mistakes I've seen in other films...and I notice them, as I was a history teacher.\n\nThe story is one of the stranger ones I've ever seen concerning slavery. It isn't really bad...just very, very unusual--especially in its way of portraying the fugitive slave trade. The film begins with Robert Taylor selling off his plantation and slaves because of his debts. It's obvious that he's pretty attached to his slaves and makes sure the families aren't separated--but he STILL sells them like they are property. So, seeing him working for the abolitionist cause later in the film is a bit of a surprise.\n\nA bit later, officials with the B&O Railroad try to hire Taylor as an agent to investigate the illegal slave trade and how it might relate to a local transportation company. I liked seeing the old fashioned trains from the 1840s that you see in the film, but Taylor wasn't as impressed nor was he willing to take the railroad's offer. However, oddly, investigating this trade is EXACTLY what Taylor ends up doing--and it hits close to home when one of his old slaves is killed by the scum behind the scheme.\n\nTaylor's nemesis throughout the film is the mean and blustery Wallace Beery. His acting, as usual, is far from subtle and he chews up practically every scene in which he appears. As a result, Taylor's good acting is all the more obvious! Overall, an interesting film--mostly because other films made around the same time didn't seem to care much about the plight of slaves. By comparison, think about the way Blacks are portrayed in \"Gone With the Wind\" which also came out the same year. Sure, it's a great film, but it also made slavery seem not so bad! So \"Stand Up and Fight\" should at least be given some credit for its rather progressive theme. The only major complaint I had about the film was the ending--it seemed a bit weak.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H37M"}