{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031133/", "name": "Calling Dr. Kildare", "image": "https://m.media-amazon.com/images/M/MV5BMzQ1NzA3YWItNmY5ZS00ODhmLTgwZTgtM2E5NDRjNmUxOGVjXkEyXkFqcGdeQXVyNDIyMTQ3Ng@@._V1_.jpg", "genre": ["Crime", "Drama"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0000817/", "name": "Lew Ayres"}, {"@type": "Person", "url": "/name/nm0000859/", "name": "Lionel Barrymore"}, {"@type": "Person", "url": "/name/nm0206478/", "name": "Laraine Day"}, {"@type": "Person", "url": "/name/nm0671738/", "name": "Nat Pendleton"}], "director": {"@type": "Person", "url": "/name/nm0118807/", "name": "Harold S. Bucquet"}, "creator": [{"@type": "Person", "url": "/name/nm0750822/", "name": "Harry Ruskin"}, {"@type": "Person", "url": "/name/nm0325135/", "name": "Willis Goldbeck"}, {"@type": "Person", "url": "/name/nm0062738/", "name": "Max Brand"}, {"@type": "Organization", "url": "/company/co0007143/"}], "description": "Calling Dr. Kildare is a movie starring Lew Ayres, Lionel Barrymore, and Laraine Day. Dr. Gillespie tries to teach Jimmy Kildare a lesson by tossing him into a street clinic. Only Kildare gets called to take a bullet out of a...", "datePublished": "1939-04-28", "keywords": "spy,murder,hospital,doctor,nurse", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 434, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031133/"}, "author": {"@type": "Person", "name": "AlsExGal"}, "dateCreated": "2020-11-19", "inLanguage": "English", "name": "Good fun Kildare film with a dash of noir", "reviewBody": "This Kildare film is a bit different from the others. Just the second in the series, Kildare is trying to find his footing in Blair hospital when he has a run in with Dr. Gillespie that could end their working relationship. But Kildare decides to stay at Blair and finish what he has started, so he begins working at one of the hospital's clinics. Somebody comes to the clinic at closing time and convinces Kildare to come with him, that somebody is very ill and can't get to the clinic. Kildare finds a guy in an abandoned building with a bullet wound. The guy's sister (Lana Turner as Rosalie) convinces Kildare that her brother has done nothing wrong and not to call the police but help her brother. Kildare relents on principle, and Rosalie's big saucer eyes and long legs can't hurt either. And then the next day he reads that a hood has been murdered and that the suspect is the guy he patched up the night before. Complications ensue.\n\nThis is where there is an implied changing of the guard as far as Kildare's love life. Remember Kildare had a \"girl next door\" pseudo fiancee in the first film, now there is this gun moll, and then there is the introduction of nurse Mary Lamont (Laraine Day) who looks like she could be in Kildare's future.\n\nI liked all of the films in this series, but I think I liked this one the least because Kildare does not have a good head on his shoulders in the decisions he makes. Fortunately for him, he has friends who do. That is how it is noir like. You have a solid citizen in the person of Kildare who has temptation in the form of a good looking girl who throws some attention his way, and this causes him to go down the wrong path, all the while justifying his actions to himself. Though Eddie Muller would probably disagree with me completely on describing it as somewhat like a noir.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H26M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1961476377", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTRhMTM0YjAtYjQ3Ny00NmRhLTk1MzEtMTVhMTY0ZjQ3OWRmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTRhMTM0YjAtYjQ3Ny00NmRhLTk1MzEtMTVhMTY0ZjQ3OWRmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "Dr. Gillespie tries to teach Jimmy Kildare a lesson by tossing him into a street clinic. Only Kildare gets called to take a bullet out of a suspected murderer, and when the cops collar him for it, he has to try and prove his patient's innocence, especially for his sister Rosalie's sake.", "uploadDate": "2020-10-26T11:42:12Z"}}