{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031313/", "name": "Fisherman's Wharf", "image": "https://m.media-amazon.com/images/M/MV5BMTQ5NzI5NjA3NV5BMl5BanBnXkFtZTcwODYyMzIzMQ@@._V1_.jpg", "genre": ["Adventure", "Drama", "Music"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0106721/", "name": "Bobby Breen"}, {"@type": "Person", "url": "/name/nm0140504/", "name": "Leo Carrillo"}, {"@type": "Person", "url": "/name/nm0035455/", "name": "Henry Armetta"}, {"@type": "Person", "url": "/name/nm0665886/", "name": "Lee Patrick"}], "director": {"@type": "Person", "url": "/name/nm0615868/", "name": "Bernard Vorhaus"}, "creator": [{"@type": "Person", "url": "/name/nm0775770/", "name": "Bernard Schubert"}, {"@type": "Person", "url": "/name/nm0402848/", "name": "Ian McLellan Hunter"}, {"@type": "Person", "url": "/name/nm0507265/", "name": "Herbert Clyde Lewis"}, {"@type": "Person", "url": "/name/nm0437189/", "name": "Aben Kandel"}, {"@type": "Organization", "url": "/company/co0027170/"}], "description": "Fisherman's Wharf is a movie starring Bobby Breen, Leo Carrillo, and Henry Armetta. Carlo Roma and his foster-son, Toma, and their friend Beppo, are living a happy fisherman's life in San Francisco until Carlo's widowed...", "datePublished": "1939-02-03", "keywords": "sister in law,fisherman,seal the animal,fisherman's wharf san francisco,cousin cousin relationship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 77, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031313/"}, "author": {"@type": "Person", "name": "bkoganbing"}, "dateCreated": "2012-03-07", "inLanguage": "English", "name": "Bobby Goes to Sea", "reviewBody": "Fisherman's Wharf is a fine family film which showcases the singing talents of young Bobby Breen. Young Breen works on a fishing boat with his father Leo Carrillo and family friend Henry Armetta. In fact the film begins and ends with Breen leading a chorus of San Francisco fishermen from Fisherman's Wharf with Come Back To Sorrento. Such other Italian traditional works like Funniculi Funnicula and Santa Lucia are among other songs Breen wrapping his soprano pipes around.\n\nInto their lives come Carrillo's newly widowed sister-in-law Lee Patrick and her spoiled brat of a son Tommy Bupp. My biggest problem with the film was the fact that Patrick's sister could marry a fisherman like Carrillo and Patrick could marry some Boston blue blood. Nevertheless she did and now she's having trouble making ends meet so the good hearted Carrillo invites them to stay with him.\n\nNo sooner does she get there in that she starts rearranging Carrillo's life which upsets Armetta and housekeeper Rosina Galli. And Bupp who's the kind of a kid you'd like to smack on general principles makes life for Breen miserable especially after he reveals a family secret. \n\nEveryone in this film including Bobby Breen have done better work, but Bobby sang well in the film. Fisherman's Wharf was on a lot of people's minds as another Italian from San Francisco whose father was a fisherman there was having one of his greatest seasons as a baseball player. Giuseppe DiMaggio could well have been in that fisherman chorus accompanying Bobby Breen.\n\nWonder if Giuseppe could carry a tune? In any event Fisherman's Wharf is a nice family picture that's a bit old fashioned for some tastes, but I rather liked it.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H12M"}