{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031678/", "name": "Mr. Moto's Last Warning", "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NTUyMjMyN15BMl5BanBnXkFtZTgwMTQyNTczMjE@._V1_.jpg", "genre": ["Crime", "Drama", "Mystery", "Romance", "Thriller"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0000048/", "name": "Peter Lorre"}, {"@type": "Person", "url": "/name/nm0007220/", "name": "Ricardo Cortez"}, {"@type": "Person", "url": "/name/nm0276065/", "name": "Virginia Field"}, {"@type": "Person", "url": "/name/nm0001017/", "name": "John Carradine"}], "director": {"@type": "Person", "url": "/name/nm0287988/", "name": "Norman Foster"}, "creator": [{"@type": "Person", "url": "/name/nm0531878/", "name": "Philip MacDonald"}, {"@type": "Person", "url": "/name/nm0287988/", "name": "Norman Foster"}, {"@type": "Person", "url": "/name/nm0549654/", "name": "John P. Marquand"}, {"@type": "Organization", "url": "/company/co0000756/"}], "description": "Mr. Moto's Last Warning is a movie starring Peter Lorre, Ricardo Cortez, and Virginia Field. Moto thwarts a ruthless band of international agents who try to foment an international incident by mining the entrance to the Suez Canal...", "datePublished": "1939-01-20", "keywords": "time bomb,mr. moto character,four word title,man wears eyeglasses,psychotronic film", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1190, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031678/"}, "author": {"@type": "Person", "name": "gftbiloxi"}, "dateCreated": "2008-02-03", "inLanguage": "English", "name": "Mildly Entertaining Entry In the 20th Century Fox Series", "reviewBody": "As originally created by author John P. Marquand, Moto was an icy and distinctly lethal Japanese agent; 20th Century Fox, which had earlier created the extremely popular Charlie Chan series, toned down his more deadly qualities, cast German actor Peter Lorre in the role, and between 1937 and 1939 made eight films featuring the character. Although they did not really challenge the Chan films, they were popular in their own right, and it was not until American sentiment began to turn against the Japanese that 20th Century Fox dropped the character.\n\nMade in 1939, MR. MOTO'S LAST WARNING is the sixth film in the series, and it finds Moto (Lorre) working to foil an attempt to set the English and French against each other by blowing up the French fleet as it enters an English-controlled canal in the middle east. Although the film has a slow start, it is graced with a gifted cast that includes George Sanders, John Carradine, and Ricardo Cortez, and it soon comes up a snappy pace and proves unexpectedly watchable.\n\nOver the years the Chan films have drawn considerable condemnation from Chinese Americans due to the fact that Chan was never played by an Asian actor; somewhat curiously, the Moto films have escaped the same degree of politically-correct derision. This is all the more odd because Lorre is even less of Japanse than Oland and Toler were Chinese. Even so, Lorre is always interesting to watch, and his unexpected physicality (Moto is a master of judo) drives the film remarkably well.\n\nMR. MOTO'S LAST WARNING is the only film in the series presently in public domain, a circumstance that seems more accidental than intentional. The Alpha release is very much in line with that: the picture is shaky, particularly in the opening segments, and the sound is quite weak. Fans of the series would do better to go with the series editions now in release through 20th Century Fox--but no matter which copy you lay hands on, you'll find the film an enjoyable bit of flyweight fun. Recommended to fans of 1930s mysteries, thrillers, and espionage movies.\n\nGFT, Amazon Reviewer", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "duration": "PT1H11M"}