{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031473/", "name": "Idiot's Delight", "image": "https://m.media-amazon.com/images/M/MV5BZTFjNmRkM2EtYWM4NS00OGQxLTg0MWYtMDY1MGE4YjQ0ZGE3XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_.jpg", "genre": ["Comedy", "Drama", "Musical", "Romance"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0790454/", "name": "Norma Shearer"}, {"@type": "Person", "url": "/name/nm0000022/", "name": "Clark Gable"}, {"@type": "Person", "url": "/name/nm0036427/", "name": "Edward Arnold"}, {"@type": "Person", "url": "/name/nm0002013/", "name": "Charles Coburn"}], "director": {"@type": "Person", "url": "/name/nm0113284/", "name": "Clarence Brown"}, "creator": [{"@type": "Person", "url": "/name/nm0062139/", "name": "Vicki Baum"}, {"@type": "Person", "url": "/name/nm0792845/", "name": "Robert E. Sherwood"}, {"@type": "Person", "url": "/name/nm0792845/", "name": "Robert E. Sherwood"}, {"@type": "Organization", "url": "/company/co0007143/"}], "description": "Idiot's Delight is a movie starring Norma Shearer, Clark Gable, and Edward Arnold. A group of disparate travelers are caught and thrown together in a posh Alpine hotel when the borders are closed at the beginning of World War II.", "datePublished": "1939-01-27", "keywords": "gin,champagne,whiskey,brandy,vermouth", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1291, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031473/"}, "author": {"@type": "Person", "name": "theowinthrop"}, "dateCreated": "2005-10-10", "inLanguage": "English", "name": "Interesting relic of it's age", "reviewBody": "Robert Sherwood's anti-war play IDIOT'S DELIGHT was one of the great acting vehicles of Alfred Lunt and Lynn Fontaine. Set in an alpine resort hotel, it is set really in 1937-39, that period when most people felt that another general European War was going to break out soon. And the threat and reality of war spreads until the final minutes when (in the play) Lunt is pounding out \"Onward Christian Soldiers\" on the piano while bombers are destroying the hotel all around him. In short, the world will probably destroy itself this time. The play was a triumph for it's stars, and won Sherwood the Pulitzer Prize. \n\nIt has dated badly, like so many anti-war pieces in the 1930s. The novel THIS GUN FOR HIRE was also anti-war, in that the villain (of the novel) was killing Europe's leading peace advocate statesman to enable a war to break out. When that novel was turned into a superior film in 1942, the plot was changed into the villains as traitors working for Japan (the original novel was set in England, not America). The changes there save THIS GUN FOR HIRE, but no such changes save IDIOT'S DELIGHT.\n\nLet me be honest here - I have seen enough bloodshed in my lifetime to hate war. Most sane people hate war. But occasionally war is necessary. When it was to destroy the Nazis it certainly was (and that was the war that was threatening in 1937 - 39). It may even be necessary against Osama Ben Laden. But there is a genuine fear created from those antagonists. A war over the ownership of some rocky territory is usually not a decent reason to mobilize for large scale bloodshed. There are legitimate reasons to oppose warfare.\n\nPeople like Sherwood and Graham Greene (author of THIS GUN FOR HIRE) happened to have latched onto a conspiracy theory regarding World War I that they just felt was true. Both men felt the real villains in 1914 - 1918 was not the various foolish leaders of the nations involved, nor the generals or admirals, or fighting men. It was the munition manufacturers. This stupid theory was given impetus in the U.S. by a special investigation committee into the sales of munitions in World War I that was conducted by North Dakota isolationist Senator Gerald P. Nye. Given the nickname: \"The Merchants of Death\" investigation, it suggested that an unholy alliance of gun and war machine factory owners and big bankers like J. P. Morgan and Kuhn Loeb & Co. had pushed the U.S. into war so that their profits could go through the roof. In England a similar view was seen in the career of the notorious arms salesman and industrialist Sir Basil Zaharoff. A man from the Balkans, Zaharoff sold arms to all countries (sometimes enemy countries at the same time) and supposedly pushed the governments into the great bloodbath to increase his profits. As Sir Basil was (erroneously) thought to be Jewish, Greene turned him into the villain of his novel (Sir Marcus, the arms manufacturer). Thinking along similar lines, Sherwood creates his version of Zaharoff as Achille Weber, the Edward Arnold role in the play and film.\n\nNo doubt munition stock zoomed during the war (except for the companies in the Central Powers who lost), but Zaharoff did not have that much influence. Suspected for being foreign born, he was not likely to be heeded on life and death matters to Great Britain or any of the other countries he dealt with. His importance was as much as anyone who would have offered to sell some new technology in each country - like Rudolf Diesel, the engine inventor, who tried to sell his engine in England.\n\nSherwood's Weber dates the play. He should have stuck to the problems of nationalism or of economic warfare. The real causes for war were badly ignored - at least in this film. The whole idea of the plot is that everyone in the resort happens to mirror all the countries in Europe, and when the war breaks up they are forced to return home to fight to the death. Typical is Charles Coburn, as a scientist working on a cancer cure. He ends bitterly returning home, to design war weapons with his knowledge of science. That is actually far more effective to get the anti-war message across.\n\nGable does a fine job as Harry Van (including his delightful song and dance number - which one wishes he had tried to repeat elsewhere), more concerned with trying to guess the identity of Norma Shearer's Irene than the impending war. Is she that phony he met ten years ago or is she actually a Russian princess? Shearer gives one of her best performances, joining Carole Lombard in THE PRINCESS COMES ACROSS in imitating Garbo (albeit as a Russian, not a Swede). Arnold's role is meaty but small, and he is properly untrustworthy - ditching Irene at the hotel under scurvy circumstances. And Laura Hope Crews as the tipsy Madame Zuleika, in Harry/Gable's first acting job, is wonderful as the world's worst mind reader. I give the film a seven - it is entertaining enough to hold your attention, despite your misgivings.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H47M"}