{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031033/", "name": "Allegheny Uprising", "image": "https://m.media-amazon.com/images/M/MV5BZGNiMzI4MDYtOGEwNy00NGU0LTlkYWEtY2MxNzZjYTkxYTg2XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg", "genre": ["Adventure", "History", "War", "Western"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0872456/", "name": "Claire Trevor"}, {"@type": "Person", "url": "/name/nm0000078/", "name": "John Wayne"}, {"@type": "Person", "url": "/name/nm0001695/", "name": "George Sanders"}, {"@type": "Person", "url": "/name/nm0002046/", "name": "Brian Donlevy"}], "director": {"@type": "Person", "url": "/name/nm0782682/", "name": "William A. Seiter"}, "creator": [{"@type": "Person", "url": "/name/nm0938439/", "name": "P.J. Wolfson"}, {"@type": "Person", "url": "/name/nm0841848/", "name": "Neil H. Swanson"}, {"@type": "Organization", "url": "/company/co0041421/"}], "description": "Allegheny Uprising is a movie starring Claire Trevor, John Wayne, and George Sanders. In 1759, in Pennsylvania's Allegheny Valley, local settlers and Indian fighters try to persuade the British authorities to ban the trading of...", "datePublished": "1939-11-10", "keywords": "fort,trader,shot in chest,delaware indian tribe,rebel", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1521, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031033/"}, "author": {"@type": "Person", "name": "dougdoepke"}, "dateCreated": "2011-03-14", "inLanguage": "English", "name": "Shadow Boxing with the British", "reviewBody": "American colonists in Pennsylvania rise up against an English army that allows illegal trading with the Indians.\n\nThe movie might be more properly titled San Fernando Valley Uprising since the terrain is familiar from a thousand matinée Westerns. Still, the producers popped for a bunch of extras with redcoats and also an impressive looking fort that even has realistic tree stumps indicating a cleared forest on the approaches.\n\nTo me, however, the movie's a disappointment. More importantly, the material shows why John Ford was such a master of this type of movie— that is,\"winning the West\" with roistering men and headstrong women, amusing drunks and slippery villains. The trouble here is that there's nothing humorous about the obnoxious drunk (Lawson), while Trevor in a padded part goes way over the top as a tomboy, but worse, she's allowed to interrupt the action just as it gets rolling. \n\nThe screenplay doesn't help either. Note that despite all the shooting and confrontations, no redcoat kills a colonist or vice-versa-- a rather strange outcome for an armed \"uprising\". My guess is that the pre-war year 1939 didn't want to show potential allies against the Nazis killing each other; then again, maybe American or British casualties would have complicated sorting out blame, which otherwise lies with the sneaky traders (Donlevy & Wolfe). Whatever the reason, it remains a pretty unbelievable development, given all the shooting. \n\nOn the other hand, Wayne shows potential as an outstanding leader of men, while Sanders is excellent as usual as a literate snob, this time an English officer. I did miss a strong Ward Bond-type as Wayne's buddy instead of the rather foolish professor (Hamilton). Anyway, the elements don't really gel into the kind of action movie that gets remembered. I just wish that superb story teller John Ford had gotten hold of the material first."}, "duration": "PT1H21M"}