{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031602/", "name": "Made for Each Other", "image": "https://m.media-amazon.com/images/M/MV5BZDhmYWI4NzItYTU4Ny00ODRlLTk4YTgtZDE2ZDUzZWEwNTJlXkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_.jpg", "genre": ["Comedy", "Drama", "Romance"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0001479/", "name": "Carole Lombard"}, {"@type": "Person", "url": "/name/nm0000071/", "name": "James Stewart"}, {"@type": "Person", "url": "/name/nm0002013/", "name": "Charles Coburn"}, {"@type": "Person", "url": "/name/nm0914778/", "name": "Lucile Watson"}], "director": {"@type": "Person", "url": "/name/nm0188669/", "name": "John Cromwell"}, "creator": [{"@type": "Person", "url": "/name/nm0842485/", "name": "Jo Swerling"}, {"@type": "Person", "url": "/name/nm0291263/", "name": "Rose Franken"}, {"@type": "Person", "url": "/name/nm0752541/", "name": "Frank Ryan"}, {"@type": "Organization", "url": "/company/co0130901/"}], "description": "Made for Each Other is a movie starring Carole Lombard, James Stewart, and Charles Coburn. While on a business trip, an ambitious young lawyer meets and immediately falls in love with a stranger. They wed the following day, and...", "datePublished": "1939-02-10", "keywords": "pneumonia,blizzard,serum,mother in law,manhattan new york city", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3246, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031602/"}, "author": {"@type": "Person", "name": "bkoganbing"}, "dateCreated": "2005-12-02", "inLanguage": "English", "name": "Sugary Melodrama", "reviewBody": "James Stewart and Carole Lombard meet and marry on impulse while Stewart is in Boston on a case.\n\nWhen they get back to New York the two of them go through a lot of the trials that newlyweds do, a seemingly unfeeling and uncomprehending boss, a bitter mother-in-law for Lombard, a new baby and then a sick toddler. I guess the fact that they get through it all is proof that they were indeed Made for Each Other.\n\nOther reviewers have noted some similarities between It's A Wonderful Life and Penny Serenade. They are certainly there. What's not there is the screwball comedy that we remember Carole Lombard for. No laughs in this one, she plays this quite seriously and shows her versatility.\n\nStewart however is pure Stewart. It's as if Jefferson Smith had gone to law school instead of becoming a Boy Ranger. He's so idealistic and full of hope as he starts married life with Lombard. As he appeals to Charles Coburn for financial help to save his kid, the whole audience in the theaters must have felt along with him.\n\nThe two have some problems keeping household staff and when they find one they really like, their budget crunch forces them to let Louise Beavers go. Though it sure has some racial clichés in it, my favorite moment comes from Louise Beavers in that scene with Carole Lombard as Lombard tells her they will have to discharge her. Beavers is a woman with real heart and soul and her words of comfort to Lombard never fail to move me.\n\nFor fans of melodramatic soap opera and the two stars. Some may find Made for Each Other too saccharine, but I like it.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H32M"}