{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031507/", "name": "Jesse James", "image": "https://m.media-amazon.com/images/M/MV5BMjViMTUyZGYtZTU4My00OGZkLWE0NTQtYTdkNWI1YzcyZjgzXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg", "genre": ["Biography", "Crime", "Drama", "History", "Western"], "contentRating": "GP", "actor": [{"@type": "Person", "url": "/name/nm0000061/", "name": "Tyrone Power"}, {"@type": "Person", "url": "/name/nm0000020/", "name": "Henry Fonda"}, {"@type": "Person", "url": "/name/nm0446715/", "name": "Nancy Kelly"}, {"@type": "Person", "url": "/name/nm0000068/", "name": "Randolph Scott"}], "director": [{"@type": "Person", "url": "/name/nm0454771/", "name": "Henry King"}, {"@type": "Person", "url": "/name/nm0191899/", "name": "Irving Cummings"}], "creator": [{"@type": "Person", "url": "/name/nm0425913/", "name": "Nunnally Johnson"}, {"@type": "Person", "url": "/name/nm0288706/", "name": "Gene Fowler"}, {"@type": "Person", "url": "/name/nm0448985/", "name": "Curtis Kenyon"}, {"@type": "Person", "url": "/name/nm0518979/", "name": "Hal Long"}, {"@type": "Organization", "url": "/company/co0000756/"}], "description": "Jesse James is a movie starring Tyrone Power, Henry Fonda, and Nancy Kelly. After railroad agents forcibly evict the James family from their family farm, Jesse and Frank turn to banditry for revenge.", "datePublished": "1939-01-27", "keywords": "shot in the back,bar,murder,fight,robbery", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3963, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031507/"}, "author": {"@type": "Person", "name": "MartinHafer"}, "dateCreated": "2009-05-23", "inLanguage": "English", "name": "Entertaining over-wrought Hollywood claptrap!", "reviewBody": "Of all the films Hollywood made during the golden years, my least favorite were ones that played very fast and loose with the facts about the Old West. And, of all the Westerns, those about Jesse James as well as the gunfight at the OK Corral are the worst. Think of it from my point of view. I am an American history teacher and for some bizarre reason, I like my historical films to actually bear some semblance to what actually occurred!! \n\nJESSE JAMES, like all these other films, is a historical nightmare from start to finish. The life of this evil killer and thief is practically impossible to discern in this silly but entertaining film from 20th Century-Fox Studios. Instead of a bad man, according to the film, he is unfairly pushed to a life of crime by an evil railroad AND he and his brother, Frank, are good boys at heart!! With such stupid revisionism, we should soon expect to see films where Hitler, Lee Harvey Oswald and Jeffrey Dahmer are heroes!! There are tons more mistakes about the characters--but simply too many to bother mentioning. In fact, what is NOT wrong would be quicker and easier to discuss!! Additionally, there are just every cliché known to Westerns, such as the shootout (\"count three and fire\"), Frank giving the town an ultimatum to give him back Jesse by midnight \"or else\", happy and intensely loyal Black servants, the Robin Hood-like quality of the gang (though at least they showed how eventually he became more of a hardened criminal), the death of Frank and Jesse's momma pushing them to crime, Henry Hull's character from start to finish as well as his comments like \"Jesse played fair\" and \"he was one of the gol-dangedest gol-darnestest buckaroos\"! \n\nAs for the non-historical aspects of the film, there is a lot to like. The film is shot in glorious Technicolor and the camera work is incredible. I especially loved the extremely difficult shot of the nighttime raid on the train--the moving external shot was NOT an easy thing to do and it looked great. Additionally, being an A-picture from the studio, the cast was spectacular--Tyrone Power (Jesse), Henry Fonda (Frank), Henry Hull (playing a role much like you might expect Walter Brennan to usually play), Randolph Scott, Jane Darwell, Donald Meek and Brian Donlevy make for an excellent cast. And, I must admit the film was fun to watch if you could care less about the facts and just want to be entertained. Unfortunately, for folks like me, it's a chore to watch even a well-made film if it's so historically inaccurate.\n\nBy the way, it should also be mentioned that according to the IMDb trivia section, this film should be remembered for its total disregard for the welfare of the horses during filming. In exciting scenes, horses actually died to make the shots look good and although I am NOT a bleeding-heart, I just can't help but be appalled with this disregard for the animals. Not surprisingly, this film led to changes in the industry to protect animals in future films.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H46M"}