{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031020/", "name": "The Adventures of Huckleberry Finn", "image": "https://m.media-amazon.com/images/M/MV5BY2RkOGUzNmEtMWFhYi00MGE3LThhY2EtMDhlZmZmOGFjN2M4XkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg", "genre": ["Adventure", "Drama", "Family"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0001682/", "name": "Mickey Rooney"}, {"@type": "Person", "url": "/name/nm0175369/", "name": "Walter Connolly"}, {"@type": "Person", "url": "/name/nm0292433/", "name": "William Frawley"}, {"@type": "Person", "url": "/name/nm0002270/", "name": "Rex Ingram"}], "director": {"@type": "Person", "url": "/name/nm0861703/", "name": "Richard Thorpe"}, "creator": [{"@type": "Person", "url": "/name/nm0124947/", "name": "Hugo Butler"}, {"@type": "Person", "url": "/name/nm0759029/", "name": "Waldo Salt"}, {"@type": "Person", "url": "/name/nm0878494/", "name": "Mark Twain"}, {"@type": "Organization", "url": "/company/co0007143/"}], "description": "The Adventures of Huckleberry Finn is a movie starring Mickey Rooney, Walter Connolly, and William Frawley. To avoid his abusive father, a rambunctious boy rafts the Mississippi River with a slave, encountering many wild characters.", "datePublished": "1939-02-10", "keywords": "character name as title,huckleberry finn character,widow douglass character,five word title,jim he slave character", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1118, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031020/"}, "author": {"@type": "Person", "name": "raskimono"}, "dateCreated": "2005-06-25", "inLanguage": "English", "name": "A shame. This movie does not follow much at all.", "reviewBody": "I am surprised that there is no other review for this movie and I am the first to post my opinion on this box office hit of 1939, a top 20 hit of its year. When I sat down to watch this adaptation of the famous Mark Twain novel, I knew the running time was under 90 minutes so I did not expect to get the full book which I have read but the cliff notes version which I have also read. But no, Louis B. Mayer just had to give it the MGM cornball effect with scenes which are not in the novel and which change the meaning and transformation of Huck's character. Mickey Rooney, the biggest child actor the movies have ever heard, and in my opinion, also the best it has had brings one of those flawless performances to the role. Rex Ingram makes for a good runaway slave Jim and the other performances are fine. Direction is pendant in the hands MGM journeyman - that is not a craftsman, not an auteur, imagination insignificant, camera angles; perfunctory, directing actors; left to your own devices - Richard Thorpe who had a long and healthy career in Hollywood. You wonder why? The first half does feel like a cliff notes version as the scenes skip through have a general lethargic pace but keeps your attention because the story is good anyway. The changes involve the capture of Jim and Huck's injury and the resolution of the aforementioned events. It is not what happens and tongue-in-cheek ending changes the message of Twain's classic. I won't say I didn't enjoy it. I just mean if you are going to alter a classic, you'd better come up with something better.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H31M"}