{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031104/", "name": "Blind Alley", "image": "https://m.media-amazon.com/images/M/MV5BYTdlYTUwZTUtYmI1Mi00NTdmLTkyNDQtMmVjZWYwNDdhY2UzXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg", "genre": ["Crime", "Drama", "Film-Noir"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0606431/", "name": "Chester Morris"}, {"@type": "Person", "url": "/name/nm0000897/", "name": "Ralph Bellamy"}, {"@type": "Person", "url": "/name/nm0245304/", "name": "Ann Dvorak"}, {"@type": "Person", "url": "/name/nm0675127/", "name": "Joan Perry"}], "director": {"@type": "Person", "url": "/name/nm0896533/", "name": "Charles Vidor"}, "creator": [{"@type": "Person", "url": "/name/nm0531878/", "name": "Philip MacDonald"}, {"@type": "Person", "url": "/name/nm0087581/", "name": "Michael Blankfort"}, {"@type": "Person", "url": "/name/nm0240488/", "name": "Albert Duffy"}, {"@type": "Person", "url": "/name/nm0913244/", "name": "James Warwick"}, {"@type": "Person", "url": "/name/nm0578439/", "name": "Lewis Meltzer"}, {"@type": "Organization", "url": "/company/co0050868/"}], "description": "Blind Alley is a movie starring Chester Morris, Ralph Bellamy, and Ann Dvorak. Gangster Hal Wilson takes psychiatrist Dr. Shelby hostage. While captive, the doctor analyzes Wilson as though he were a patient.", "datePublished": "1939-05-11", "keywords": "reference to alice in wonderland,psychiatrist,hostage,warden,umbrella", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 551, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031104/"}, "author": {"@type": "Person", "name": "bkoganbing"}, "dateCreated": "2011-08-10", "inLanguage": "English", "name": "Killer Personality", "reviewBody": "When I wrote a review of the remake of Blind Alley that starred William Holden I had not yet seen this nor had investigated the Broadway play from where this film came from. I've come to some interesting conclusions as a result.\n\nChester Morris plays the killer role in Blind Alley which is a combination of The Petrified Forest and The Desperate Hours and the viewer will recognize parts of both those classics. Morris and his gang are on the run having just busted out of prison where they took the warden hostage and Morris kills him. He then takes refuge at the lakeside home of Ralph Bellamy and wife Rose Stradner who happen to be entertaining guests at the time.\n\nBellamy is a psychiatrist who teaches and after Morris coldbloodedly murders Stanley Brown one of his students he thinks the only way to save his and everyone else's lives is to get into his head. Bellamy is a cool customer doing this, especially with friends and family's lives at stake. \n\nWhen Lee J. Cobb played the part of the psychiatrist in The Dark Past he was detached almost clinical in the way he probed at Holden. Bellamy is not looking at this as an experiment and now having seen both films I can say Bellamy's interpretation was superior.\n\nBlind Alley originated as a play on Broadway by James Warwick with a 119 performance run in the 1935-36 season. Looking at that cast I saw that George Coulouris played the psychiatrist and this is one instance where we are so unfortunate that he did not do either movie version. Coulouris would really have been special in the part.\n\nThis film is a real sleeper from Columbia Pictures, don't miss it if ever broadcast again.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H9M"}