{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031405/", "name": "Hare-um Scare-um", "image": "https://m.media-amazon.com/images/M/MV5BMWYxODJkZDItZDJiOC00ZThiLWE5NzItZGU0ZTBiZjJmMzVjXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg", "genre": ["Family", "Animation", "Short", "Comedy"], "contentRating": "Approved", "actor": {"@type": "Person", "url": "/name/nm0000305/", "name": "Mel Blanc"}, "director": [{"@type": "Person", "url": "/name/nm0198246/", "name": "Cal Dalton"}, {"@type": "Person", "url": "/name/nm0362041/", "name": "Ben Hardaway"}], "creator": [{"@type": "Person", "url": "/name/nm0587689/", "name": "Melvin Millar"}, {"@type": "Organization", "url": "/company/co0137897/"}], "description": "Hare-um Scare-um is a short starring Mel Blanc. A hungry hunter pursues a wily rabbit who's one step ahead of him and his hound.", "datePublished": "1939-08-12", "keywords": "rabbit,newspaper,hunter,cartoon rabbit,animal tracks", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 362, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031405/"}, "author": {"@type": "Person", "name": "lee_eisenberg"}, "dateCreated": "2008-07-03", "inLanguage": "English", "name": "food crisis", "reviewBody": "The current food crisis (or whatever to call it) in the world makes the otherwise goofy \"Hare-um Scare-um\" rather relevant. When a hunter can't buy food at the store, he and his dog go hunting. Needless to say, they come across a manic rabbit who makes their lives a living hell. Talking like Woody Woodpecker and behaving like Daffy Duck, this hare is a really wacky one! As the anonymous bunny affirms: \"You don't have to be crazy to do this...but it sure helps!\" Obviously, this cartoon holds a special historical significance as one of four cartoons (the others were \"Porky's Hare Hunt\", \"Prest-o Change-o\" and \"Elmer's Candid Camera\") starring the rabbit who eventually morphed into Bugs Bunny. Even if you don't know that the leporid here would soon become a street-smart, wise-cracking dude with a Brooklyn-Bronx accent, the cartoon is still a total hoot. But the fact that this nutty rabbit soon evolved into the Groucho Marx of rabbits just goes to show the importance (not to mention the hilarity) of this cartoon, and Mel Blanc's talent with voices. I truly recommend it.\n\nPS: director Cal Dalton ran Friz Freleng's unit from 1937-1939. Freleng had moved to MGM for a more lucrative job, and so Cal Dalton and Ben Hardaway took over his unit. When MGM canceled the series that Freleng had been directing, Warner Bros. rehired him (\"You Ought to Be in Pictures\" loosely alluded to his experience).", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT8M"}