{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031392/", "name": "The Great Man Votes", "image": "https://m.media-amazon.com/images/M/MV5BZGNjMjY5YmItMmIwNy00YjM1LWE1OGMtNmU2MWRjZDljZDIyXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg", "genre": "Drama", "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0000858/", "name": "John Barrymore"}, {"@type": "Person", "url": "/name/nm0390250/", "name": "Peter Holden"}, {"@type": "Person", "url": "/name/nm0917768/", "name": "Virginia Weidler"}, {"@type": "Person", "url": "/name/nm0018540/", "name": "Katharine Alexander"}], "director": {"@type": "Person", "url": "/name/nm0437717/", "name": "Garson Kanin"}, "creator": [{"@type": "Person", "url": "/name/nm0385056/", "name": "Gordon Malherbe Hillman"}, {"@type": "Person", "url": "/name/nm0878605/", "name": "John Twist"}, {"@type": "Person", "url": "/name/nm0437717/", "name": "Garson Kanin"}, {"@type": "Organization", "url": "/company/co0041421/"}], "description": "The Great Man Votes is a movie starring John Barrymore, Peter Holden, and Virginia Weidler. In 1923, Gregory Vance, a widower with two children, is a former scholar who has turned from book-to-bottle. He works, slightly, as a...", "datePublished": "1939-01-13", "keywords": "scholar,principal,united states of america,year 1923,bootlegger", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 528, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031392/"}, "author": {"@type": "Person", "name": "mkilmer"}, "dateCreated": "2007-03-05", "inLanguage": "English", "name": "A Great Man is saved.", "reviewBody": "I have nothing objective to add to Theowinthrop's commentary on THE GREAT MAN VOTES here at IMDb, but I want to add my own observations concerning and reactions to the film. It had been only a few months since I'd seen John Barrymore, with Delores Costello in WHEN A MAN LOVES (1927), and I liked this role better than that of a man in love fighting the powers that be for the love of a girl and that girl's honor. Simple stuff.\n\nIn this one, Barrymore plays Gregory Vance, a \"Great Man\" under the thumb of the bottle since the death of the love of his life. He loves his two children, who are part of her, and they believe that he is still a \"Great Man.\" The kids at school label him a drunk, and that's what he is to them.\n\nHearing Vance speak, learning his history, you know he was a Great Man, and you yearn for him to be one again, for his sake and for that of his children. He has that opportunity, and his children are happy for it. (They kids handle the negotiation. It's splendid.) But does he have to sell his soul, in a manner of speaking, to attain it? There's a heavy streak of partisan politics, though the party name is never specified, and you have a ward boss called Iron Hat who doesn't seem so bad as his awful son.\n\nThis movie worked. Since this was Barrymore's last important leading role, he goes out on a wonderful note. And, yes, he played a good drunk."}, "duration": "PT1H12M"}