{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031210/", "name": "Dark Victory", "image": "https://m.media-amazon.com/images/M/MV5BYmRlOWMxNGEtMDJmZS00YTkyLTg2MzItNjA4ODM2MmQzZDljXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0000012/", "name": "Bette Davis"}, {"@type": "Person", "url": "/name/nm0107575/", "name": "George Brent"}, {"@type": "Person", "url": "/name/nm0000007/", "name": "Humphrey Bogart"}, {"@type": "Person", "url": "/name/nm0280242/", "name": "Geraldine Fitzgerald"}], "director": {"@type": "Person", "url": "/name/nm0332539/", "name": "Edmund Goulding"}, "creator": [{"@type": "Person", "url": "/name/nm0732452/", "name": "Casey Robinson"}, {"@type": "Person", "url": "/name/nm0108108/", "name": "George Emerson Brewer Jr."}, {"@type": "Person", "url": "/name/nm0088602/", "name": "Bertram Bloch"}, {"@type": "Organization", "url": "/company/co0002663/"}], "description": "Dark Victory is a movie starring Bette Davis, George Brent, and Humphrey Bogart. A young socialite is diagnosed with an inoperable brain tumor, and must decide whether or not she'll meet her final days with dignity.", "datePublished": "1939-04-22", "keywords": "love,brain tumor,doctor,socialite,secretary", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 9918, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031210/"}, "author": {"@type": "Person", "name": "willowgreen"}, "dateCreated": "2003-02-13", "inLanguage": "English", "name": "The Epitome of Davis Soaps", "reviewBody": "Bette Davis always cited this as her favourite role: it is probably on a par with Margo Channing in ALL ABOUT EVE as the part which fans identify with as definitive Davis. Naturally, this 1939 film will look a little musty, corny and cliched to modern day viewers, but the poignant sincerity in which Davis instilled via her magnificent performance still has the ability to leave the viewer in helpless tears: you can be dumbfounded to think that something so obviously aimed at your tear ducts could succeed to induce the flow so completely and spontaneously!  The role is based upon a 1934 play in which Tallulah Bankhead flopped.  The character of Ann King was written especially for the film by director Edmund Goulding: as a kind of Greek Chorus so Judith wouldn't have to complain about the inevitable. Geraldine Fitzgerald, in her American film debut, does a wondrous job with the part of Ann: a beautifully etched supporting performance.  As Michael O'Leary, Humphrey Bogart is unfortunately inept in the Irish brogue department (why couldn't they have simply cut out the accent?) and George Brent is adequately wooden as Dr. Frederick Steele whom Judy marries.  Davis slams through a gooey collection of cliches in her nerviest style during the early segments but her metamorphasis into a vibrantly humbled married woman is quite a striking contrast to the selfishly brazen spoiled heiress: truly a multi-faceted performance.  Ronald Reagan gets to play Alec, one of Judy's drunken swains, and Cora Witherspoon is memorable as the snotty Carrie.  The last twenty minutes of the film are expertly crafted and timelessly tear-jerking: the movie sold more kleenex than any other of its day.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H44M"}