{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031243/", "name": "Donald's Penguin", "image": "https://m.media-amazon.com/images/M/MV5BMTQ4Y2EyNWItZTQ5Ny00NTZiLWE0ZTAtYzY3NGRlMmU2NWY5XkEyXkFqcGdeQXVyNzQzMjczNzE@._V1_.jpg", "genre": ["Family", "Animation", "Short", "Comedy"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0542587/", "name": "Louis Manley"}, {"@type": "Person", "url": "/name/nm0621699/", "name": "Clarence Nash"}, {"@type": "Person", "url": "/name/nm10421115/", "name": "Tootsie"}], "director": {"@type": "Person", "url": "/name/nm0454790/", "name": "Jack King"}, "creator": [{"@type": "Person", "url": "/name/nm0055119/", "name": "Carl Barks"}, {"@type": "Organization", "url": "/company/co0098836/"}], "description": "Donald's Penguin is a short starring Louis Manley, Clarence Nash, and Tootsie. Admiral Byrd ships Donald a penguin from the South Pole. Donald is amused by it, until he thinks it has eaten his goldfish. It hasn't - yet - so Donald...", "datePublished": "1939-08-11", "keywords": "half dressed cartoon animal,barefoot cartoon animal,animal character name in title,donald duck character,two word title", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 543, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031243/"}, "author": {"@type": "Person", "name": "Ron Oliver"}, "dateCreated": "2003-01-25", "inLanguage": "English", "name": "Two Birds Not Of A Feather", "reviewBody": "A Walt Disney DONALD DUCK Cartoon.\n\nDONALD'S PENGUIN - a surprise gift from Admiral 'Bird' at the South Pole - arrives and takes an immediate interest in the Duck's pet fish...\n\nThis enjoyable little film features good animation and a lively interplay between the two main characters. Although cute & full of spunk, this was to be Tootsie the penguin's only appearance in a Disney cartoon. The story was written by the legendary Carl Barks. Clarence \"Ducky\" Nash provides Donald with his unique voice, as well as producing a penguin noise or two.\n\nWalt Disney (1901-1966) was always intrigued by drawings. As a lad in Marceline, Missouri, he sketched farm animals on scraps of paper; later, as an ambulance driver in France during the First World War, he drew figures on the sides of his vehicle. Back in Kansas City, along with artist Ub Iwerks, Walt developed a primitive animation studio that provided animated commercials and tiny cartoons for the local movie theaters. Always the innovator, his ALICE IN CARTOONLAND series broke ground in placing a live figure in a cartoon universe. Business reversals sent Disney & Iwerks to Hollywood in 1923, where Walt's older brother Roy became his lifelong business manager & counselor. When a mildly successful series with Oswald The Lucky Rabbit was snatched away by the distributor, the character of Mickey Mouse sprung into Walt's imagination, ensuring Disney's immortality. The happy arrival of sound technology made Mickey's screen debut, STEAMBOAT WILLIE (1928), a tremendous audience success with its use of synchronized music. The SILLY SYMPHONIES soon appeared, and Walt's growing crew of marvelously talented animators were quickly conquering new territory with full color, illusions of depth and radical advancements in personality development, an arena in which Walt's genius was unbeatable. Mickey's feisty, naughty behavior had captured millions of fans, but he was soon to be joined by other animated companions: temperamental Donald Duck, intellectually-challenged Goofy and energetic Pluto. All this was in preparation for Walt's grandest dream - feature length animated films. Against a blizzard of doomsayers, Walt persevered and over the next decades delighted children of all ages with the adventures of Snow White, Pinocchio, Dumbo, Bambi & Peter Pan. Walt never forgot that his fortunes were all started by a mouse, or that simplicity of message and lots of hard work will always pay off."}, "duration": "PT7M"}