{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0028331/", "name": "Sweeney Todd: The Demon Barber of Fleet Street", "image": "https://m.media-amazon.com/images/M/MV5BYTNmMzYwMTktM2I5MS00NmI4LTk0NWUtODg5MDVkODg4OGI5XkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg", "genre": ["Drama", "Fantasy", "Horror"], "actor": [{"@type": "Person", "url": "/name/nm0805532/", "name": "Tod Slaughter"}, {"@type": "Person", "url": "/name/nm0722310/", "name": "Stella Rho"}, {"@type": "Person", "url": "/name/nm0801967/", "name": "John Singer"}, {"@type": "Person", "url": "/name/nm0514249/", "name": "Eve Lister"}], "director": {"@type": "Person", "url": "/name/nm0454734/", "name": "George King"}, "creator": [{"@type": "Person", "url": "/name/nm0371741/", "name": "Frederick Hayward"}, {"@type": "Person", "url": "/name/nm0540763/", "name": "H.F. Maltby"}, {"@type": "Person", "url": "/name/nm1108961/", "name": "George Dibdin-Pitt"}, {"@type": "Organization", "url": "/company/co0116383/"}], "description": "Sweeney Todd: The Demon Barber of Fleet Street is a movie starring Tod Slaughter, Stella Rho, and John Singer. A Fleet Street barber recounts the story of Sweeney Todd, a notorious barber who in the last century murdered many...", "datePublished": "1939-09-29", "keywords": "sweeney todd character,psychotronic film,barber,meat pie,murder", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 826, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0028331/"}, "author": {"@type": "Person", "name": "BA_Harrison"}, "dateCreated": "2019-10-04", "inLanguage": "English", "name": "Sweeney supplies the meat; Slaughter delivers the ham.", "reviewBody": "The aptly named Tod Slaughter stars as legendary barber Sweeney Todd, who 'polishes off' his customers in order to steal their valuables, while at the same time supplying baker Mrs. Lovatt (Stella Rho) with plenty of filling for her tasty meat pies. Investing his ill-gotten gains in the latest project of ship-builder Stephen Oakley, Sweeney uses his financial leverage to force the businessman's daughter Johanna into marrying him. When Johanna's seafaring fella Mark returns to England a rich man, and goes for a shave at Todd's establishment before meeting his girl, the wicked barber sees an opportunity to get even richer whilst removing an awkward obstacle.\n\nAlthough the plot for this version of Sweeney Todd is fairly predictable Victorian-style melodrama, the film is still a lot of fun thanks to Slaughter, who gleefully hams it up with a memorable lead performance that positively invites boos and hisses from the audience. Cackling like a maniac as he goes about his work, dumping unsuspecting victims into his cellar with the aid of a special booby-trapped chair, slapping about his 12-year-old apprentice (his 8th, the previous seven having mysteriously disappeared), and lusting after Johanna, Todd is a truly loathsome character, Slaughter's over-the-top mannerisms perfect for the role.\n\nAdmittedly, it's a fairly repetitive film and all gets very silly towards the end, with Johanna going to Sweeney's shop in disguise as a young lad (Todd failing to recognise the woman thanks to her clothing and a few cinders rubbed on her face), and the barber failing to make good his escape, instead re-entering his blazing barber shop to deal with Mark, but to be honest, any film that features the word 'Lumme' is fine by me. Look out too for an African native called Snowdrop (I'm surprised that the PC brigade hasn't 'fixed' the film for a modern audience).\n\n4.5/10, rounded up to 5 for IMDb.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "duration": "PT1H16M"}