{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031514/", "name": "Le jour se lève", "image": "https://m.media-amazon.com/images/M/MV5BMjI2MTc2NzQyMl5BMl5BanBnXkFtZTgwNTg1MTMxMzE@._V1_.jpg", "genre": ["Crime", "Drama", "Romance", "Thriller"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0300064/", "name": "Jean Gabin"}, {"@type": "Person", "url": "/name/nm0491238/", "name": "Jacqueline Laurent"}, {"@type": "Person", "url": "/name/nm0001916/", "name": "Arletty"}, {"@type": "Person", "url": "/name/nm0077598/", "name": "Jules Berry"}], "director": {"@type": "Person", "url": "/name/nm0138893/", "name": "Marcel Carné"}, "creator": [{"@type": "Person", "url": "/name/nm0899254/", "name": "Jacques Viot"}, {"@type": "Person", "url": "/name/nm0699535/", "name": "Jacques Prévert"}, {"@type": "Organization", "url": "/company/co0053345/"}], "description": "Le jour se lève is a movie starring Jean Gabin, Jacqueline Laurent, and Arletty. After committing a murder, a man locks himself in his apartment and recollects the events that led him to the killing.", "datePublished": "1939-08-09", "keywords": "factory worker,suicide by gunshot,tragic love,working class,murder", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 6716, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031514/"}, "author": {"@type": "Person", "name": "Varlaam"}, "dateCreated": "1999-02-03", "inLanguage": "English", "name": "A tragedy of everyday proportions", "reviewBody": "We see a man shot; who he is and why we don't know. The murderer has locked himself inside his room. Police are forced to shoot in, trying to get him to surrender. The story then proceeds in flashback.\n\nMarcel Carné directs this famous French film starring Jean Gabin. The two had worked together the previous year on \"Le quai des brumes\", a film well known then and now. If you are unfamiliar with Gabin, he was to the late 1930's in France what Bogey would be shortly in America, only Bogey with a soupçon of Cagney. More animated than Bogart, but less than Cagney with his agile song-and-dance-man side. A tough guy who's actually a good guy.\n\nNow, a soft-hearted tough guy who's surrounded by police -- that could also describe Bogart's breakthrough film, \"High Sierra\", from 1941, and perhaps there is some superficial similarity.\n\nHowever, this story is mostly a tale of love affairs and working class life -- that's really where its interest lies. There's a real sympathy here for the common man, when even a modest house on a rutted street would seem beyond his reach.\n\nThis film's original reputation may have been based at least in part on its Gallic openness about sexual matters. It's quite outré by the Anglo-Saxon standards of 1939. Regardless, the justly celebrated \"Le jour se lève\" has a poetic quality overall, and a memorably ironic final shot of the kind we don't seem to see quite often enough anymore.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H33M"}