{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031500/", "name": "It's a Wonderful World", "image": "https://m.media-amazon.com/images/M/MV5BMDk5ZGQ3YzgtMWMxNi00MGFiLThiZmEtNDRhOThmNDgyZTQ5XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg", "genre": ["Comedy", "Crime", "Mystery", "Romance"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0001055/", "name": "Claudette Colbert"}, {"@type": "Person", "url": "/name/nm0000071/", "name": "James Stewart"}, {"@type": "Person", "url": "/name/nm0452128/", "name": "Guy Kibbee"}, {"@type": "Person", "url": "/name/nm0671738/", "name": "Nat Pendleton"}], "director": {"@type": "Person", "url": "/name/nm0886754/", "name": "W.S. Van Dyke"}, "creator": [{"@type": "Person", "url": "/name/nm0372942/", "name": "Ben Hecht"}, {"@type": "Person", "url": "/name/nm0372942/", "name": "Ben Hecht"}, {"@type": "Person", "url": "/name/nm0542534/", "name": "Herman J. Mankiewicz"}, {"@type": "Organization", "url": "/company/co0007143/"}], "description": "It's a Wonderful World is a movie starring Claudette Colbert, James Stewart, and Guy Kibbee. When a tycoon is accused of murder, the private eye tracking him finds himself roped in as an accessory and attempts to evade police,...", "datePublished": "1939-05-19", "keywords": "private detective,heir,newspaper headline,breach of promise suit,revolving door", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 2617, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031500/"}, "author": {"@type": "Person", "name": "jimjo1216"}, "dateCreated": "2010-05-26", "inLanguage": "English", "name": "Claudette Colbert shines in this little-known comedy with Jimmy Stewart", "reviewBody": "Although the title doesn't say much about the film, IT'S A WONDERFUL WORLD (1939) is basically a screwball comedy about a detective on the lam and on the case. It's pretty funny, with great performances by Claudette Colbert and Guy Kibbee, and it's a story centered around murder, crime, evading the police, etc.\n\n(The film's title comes from a line in a poem written by Colbert's character and has little, if anything, to do with the movie's plot.)\n\nJames Stewart, still early in his illustrious career, plays a private detective who is wrongfully accused and escapes on his way to prison. He thinks he can crack the case, if the cops don't catch up with him first. He is joined by Colbert's character and the two of them try to elude the police manhunt.\n\nStewart's character is a little different from the roles for which he's best known. As a detective he's rougher and more cynical than viewers would expect of Stewart. As always, his performance is solid. There's one part of the film when he wears a scout's master disguise, complete with silly thick-lensed eyeglasses. Some of the physical comedy stemming from the character's visual impairment is gold. It's cool to see Stewart star in a detective comedy.\n\nColbert is very good in this film as well, playing Stewart's accomplice. She's eager to help Stewart's character, even when he'd rather be rid of her. (She does her darndest to disprove Stewart's theory that all women are dumb.) Colbert was a seasoned Hollywood star by the time this film was made (she'd won an Oscar for 1934's IT HAPPENED ONE NIGHT) and her performance is top-notch.\n\nKey supporting roles go to Guy Kibbee as Stewart's partner and Nat Pendleton as the police sergeant on Stewart's trail. Kibbee has some scene-stealing moments in the movie's final act. A young Hans Conried (perhaps best known for his voice work as Captain Hook, Snidely Whiplash, and Horton the Elephant) has a brief role as the stage manager at the Saugerties theater.\n\nA lot of talent worked on this rather obscure comedy. James Stewart and Claudette Colbert starred. W.S. Van Dyke directed. The great Ben Hecht wrote the screenplay. It seems like a recipe for success, but for whatever reason IT'S A WONDERFUL WORLD is not well-remembered nowadays. (It's probably overshadowed by Stewart's other \"wonderful\" film, 1946's IT'S A WONDERFUL LIFE.) I think it's a nice little comedy with some big names. It has its moments and it's pretty funny. It probably won't blow you away, but it's worth checking out if it's on TCM or something."}, "duration": "PT1H26M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1373946137", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjhmNzVlMjYtMDg3Ny00NDBkLWExYzItMDMwMWM3ZWJiYzJmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjhmNzVlMjYtMDg3Ny00NDBkLWExYzItMDMwMWM3ZWJiYzJmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "When a tycoon is accused of murder, the private eye tracking him finds himself roped in as an accessory and attempts to evade police, kidnapping a poetess along the way.", "uploadDate": "2020-10-23T10:01:49Z"}}