{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031971/", "name": "Stagecoach", "image": "https://m.media-amazon.com/images/M/MV5BOGQ4NDUyNWQtZTEyOC00OTMzLWFhYjAtNDNmYmQ2MWQyMTRmXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg", "genre": ["Adventure", "Drama", "Western"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0000078/", "name": "John Wayne"}, {"@type": "Person", "url": "/name/nm0872456/", "name": "Claire Trevor"}, {"@type": "Person", "url": "/name/nm0222596/", "name": "Andy Devine"}, {"@type": "Person", "url": "/name/nm0001017/", "name": "John Carradine"}], "director": {"@type": "Person", "url": "/name/nm0000406/", "name": "John Ford"}, "creator": [{"@type": "Person", "url": "/name/nm0370697/", "name": "Ernest Haycox"}, {"@type": "Person", "url": "/name/nm0629580/", "name": "Dudley Nichols"}, {"@type": "Person", "url": "/name/nm0372942/", "name": "Ben Hecht"}, {"@type": "Organization", "url": "/company/co0035064/"}], "description": "Stagecoach is a movie starring John Wayne, Claire Trevor, and Andy Devine. A group of people traveling on a stagecoach find their journey complicated by the threat of Geronimo and learn something about each other in the process.", "datePublished": "1939-03-03", "keywords": "arizona territory,prostitution,apache wells arizona,new mexico territory,apache territory", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 43271, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031971/"}, "author": {"@type": "Person", "name": "BrandtSponseller"}, "dateCreated": "2005-04-30", "inLanguage": "English", "name": "A great western which enables multiple interpretations", "reviewBody": "John Wayne is \"The Ringo Kid\" in this John Ford-directed parable of outcasts traveling towards various kinds of figurative and literal redemption/salvation. On a surface level, the basic plot is disarmingly simple--a motley crew of eight takes a stagecoach from Tonto to Lordsburg, trying to avoid Geronimo and his Apaches on the way. They are having their own problems with the U.S. government and are thus likely to attack. The stagecoach bounces from outpost to outpost while the relationships of its passengers evolve, helping each other to \"find themselves\" and (usually) providing hope of some kind of new life.\n\nThe Ringo Kid has been wrongly accused of a crime and is on his way to Lordsburg to avenge both the false accusations and more importantly, the murder of his father and brother. Dallas (Claire Trevor) is implied to be a prostitute, and so is ostracized from Tonto (which means \"stupid\", \"foolish\" or \"daft\" in Spanish) by a self-stylized matronly moral majority. Doc Boone (Thomas Mitchell) is far more concerned with getting drunk than being a doctor, and is partially ostracizing himself from Tonto. Hatfield (John Carradine) is a \"gambler gentleman\" with a shady reputation and a false identity. Lucy Mallory (Louise Platt) is trying to get to her husband, who is in the military; she's in a surprisingly \"secret\" physical state. Samuel Peacock, whom everyone keeps mistaking for a reverend, is in the alcohol business and just wants to get back east to get back to his business. Henry Gatewood is a crooked banker trying to flee before his questionable dealings are discovered. And the stagecoach drivers consist of a lovable buffoon, Buck (Andy Devine) and the most forthright, straight arrow of the bunch, Marshal Curly Wilcox (George Bancroft).\n\nEven though Stagecoach remains tightly focused on its wilderness road trip, that might seem like a large stable of characters to shape into a taut plot. Ford, working from script by Dudley Nichols and Ben Hecht, based on a short story, \"Stage to Lordsburg\", by Ernest Haycox (which itself bears a relation to Guy de Maupassant's \"Boule de Suif\", 1880), keeps the proceedings in check by only giving us the information we need to explore the evolving relationships, and only focusing on each character when they're important to the plot. This results in a few of the characters being functionally absent for extended lengths of time, but Ford can so easily establish a \"deep\" character with a minimum of screen time that the absences are not a detriment.\n\nThe principal focus, of course, is between Ringo and Dallas, as on a significant level, Stagecoach becomes a romance. They're initially brought together via their mutual ostracization, even among the ostracized, which gives them an immediate bond beyond their physical attraction towards one another. Wayne and Trevor are both fantastic in their roles, avoiding the occasional overacting by some other performers. But this is a film where it's difficult to count the slight overacting as a flaw, as it was more of a stylistic tendency of the genre during this period and it provides a nice counterbalance to Wayne and Trevor.\n\nStagecoach is also famous for its setting. Much of the film was shot in Utah's Monument Valley, along authentic stagecoach \"roads\". The (beautiful) starkness of the desert is often taken as a symbolic trip through a kind of purgatory for the characters, where they're left alone with their souls, their only connection being their small group, to contemplate their pasts and futures. Whether we choose to read something along those lines into the film or not, Monument Valley is at least a captivating presence in the film, although for me, the cinematography could have been better technically, especially considering that Stagecoach was made at the same time as The Wizard of Oz (1939). Ford's famous tendency to do only one take results in a couple minor gaffes, such as the initial shot of John Wayne--a zoom into a close-up--that is out of focus for most of the zoom.\n\nAs one could guess, eventually our passengers run into a band of Apaches, who are often interpreted as representing more of a \"natural force\" that our heroes must surmount. The climax features a fabulous extended chase/fight sequence with a number of amazing stunts by both humans and animals. The most impressive human stunts are performed by the legendary Yakima Canutt, including one that involved being dragged through the dirt by the horse-pulled stagecoach, which was moving along at about 40 miles per hour and supposedly missed running over Canutt by only 12 inches (30.5 cm). This scene was an inspiration for a similar stunt in Steven Spielberg's Raiders of the Lost Ark (1981).\n\nAlthough it's not a \"perfect\" film to me, and it's not even my favorite western (I'm more partial to the classic spaghetti westerns, for example), Stagecoach is a very good film and was very influential, despite being made at a time when Ford was told that he was committing professional suicide by even contemplating a western. As the plethora of critical literature attests, it works on many levels, including as an allegorical microcosm of U.S. Depression-era society, and should be seen at least once by anyone serious about film literacy.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H36M", "trailer": {"@type": "VideoObject", "name": "Stagecoach", "embedUrl": "/video/imdb/vi4149215257", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzdlODQwN2UtNmU1OC00YjIxLTg4ZWEtMjJjYWMyNTBjOWI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzdlODQwN2UtNmU1OC00YjIxLTg4ZWEtMjJjYWMyNTBjOWI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Theatrical Trailer from Warner Home Video", "uploadDate": "2008-10-30T03:45:15Z"}}