{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0030814/", "name": "Suspiros de España", "image": "https://m.media-amazon.com/images/M/MV5BZWY0NzU3ZDUtZjAwMy00MTNjLTk5YTMtMTc0NDI1MTIyYTYxXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1_.jpg", "genre": "Comedy", "actor": [{"@type": "Person", "url": "/name/nm0002816/", "name": "Miguel Ligero"}, {"@type": "Person", "url": "/name/nm0145537/", "name": "Estrellita Castro"}, {"@type": "Person", "url": "/name/nm0721158/", "name": "Roberto Rey"}, {"@type": "Person", "url": "/name/nm0145907/", "name": "Concha Catalá"}], "director": {"@type": "Person", "url": "/name/nm0674398/", "name": "Benito Perojo"}, "creator": [{"@type": "Person", "url": "/name/nm0674398/", "name": "Benito Perojo"}, {"@type": "Person", "url": "/name/nm0704210/", "name": "Antonio Quintero"}, {"@type": "Person", "url": "/name/nm0723043/", "name": "Roberto de Ribón"}, {"@type": "Person", "url": "/name/nm0959485/", "name": "L. Álvarez"}, {"@type": "Organization", "url": "/company/co0037254/"}], "description": "Suspiros de España is a movie starring Miguel Ligero, Estrellita Castro, and Roberto Rey. Soledad and her battling mother work as laundresses in Seville. When Sole's lively godfather sends a photograph of her to a musical producer,...", "datePublished": "1939-10-16", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 18, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0030814/"}, "author": {"@type": "Person", "name": "echanove"}, "dateCreated": "2015-10-20", "inLanguage": "English", "name": "Paradoxes of a mythic title shot during a national tragedy", "reviewBody": "This is a mythic title of Spanish folkloric cinema, directed by the responsible of the superb 'La Verbena de La Paloma', Benito Perojo, with two of that cast on the screen (Miguel Ligero and Roberto Rey) besides the starring of the likable copla singer Estrellita Castro.\n\nIn fact, the popular tune composed in 1903 that titled the movie has been considered for a long time (and probably is still nowadays) a sort of unofficial Spanish anthem. As it is known, one of the trouble of the official is that it lacks of lyrics. Well, 'Suspiros de España' neither had lyrics when the film was made, but they were written for it !! And since then, it has had at least two more !!\n\nIn addition to all this, the film was made during the Spanish Civil War by the Franco side and it is one of the handful of movies filmed at the UFA German studios, with German crew, during the nazi regime, as a part of Hitler's help to Franco during the war. There's a recent film by Fernando Trueba, La Niña de tus ojos (1998), about this odd episode of Spanish cinema.\n\nSo, you may think that the film has a lot of nazi or fascist ideology on it. No, it hasn't !! It's just a sentimental folk comedy (and by the way rather mediocre!) !And one of its big paradoxes is that the popular tune that Estrellita Castro performed with vocals here for the first time, and then has been performed by a lot of artists, became immediately later in the tune for the people that after the war went to exile !!\n\nWell, all these things are involved with this film, but notwithstanding all this, it can be also considered in other ways: has it artistic quality ? Was it enjoyable? \n\nI have to say that I've just watched it and it disappointed me in many aspects. There is a later version produced by Perojo and directed by Ramón Torrado, Suspiros de Triana (1955), that in my personal opinion is rather better, though is fair to say that the final minutes of this one are superior, and also the performance of the main tune and the highness of the patriotic feelings of the Spanish immigrants in the elegant boat sequences. Inmediatly after Estrella singing of Suspiros, both Miguel Ligero and her sing and dance a joyfully and funny rumba at the boat deck. The best of the film, alongside with the final song.\n\nBut the rest of the footage is quite vulgar and it's clear that despite the UFA help, Perojo hasn't the budget of 'La Verbena de La Paloma'. Or may be he wasn't comfortable working with the Germans, who knows...The fact is that the film is badly shot and worse acted at many times. For example, Miguel Ligero is horrible in this film, making faces all the time, or quarreling loudly with her sister in the plot. It tries to be funny but it isn't, and nothing to do with other of his films or the performance of Antonio Riquelme in the later version.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "duration": "PT1H40M"}