{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031311/", "name": "First Love", "image": "https://m.media-amazon.com/images/M/MV5BNTFiZmY3OGQtNDMzNS00NjY1LTg1MTUtNzk1ZGE5MzZlOGY0XkEyXkFqcGdeQXVyMzc5ODc1MDY@._V1_.jpg", "genre": ["Comedy", "Musical"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0002052/", "name": "Deanna Durbin"}, {"@type": "Person", "url": "/name/nm0821041/", "name": "Robert Stack"}, {"@type": "Person", "url": "/name/nm0657874/", "name": "Eugene Pallette"}, {"@type": "Person", "url": "/name/nm0663540/", "name": "Helen Parrish"}], "director": {"@type": "Person", "url": "/name/nm0467396/", "name": "Henry Koster"}, "creator": [{"@type": "Person", "url": "/name/nm0543243/", "name": "Bruce Manning"}, {"@type": "Person", "url": "/name/nm0396754/", "name": "Lionel Houser"}, {"@type": "Person", "url": "/name/nm0043081/", "name": "Stephen Morehouse Avery"}, {"@type": "Person", "url": "/name/nm0616730/", "name": "Henry Myers"}, {"@type": "Person", "url": "/name/nm0700717/", "name": "Gertrude Purcell"}, {"@type": "Organization", "url": "/company/co0005073/"}], "description": "First Love is a movie starring Deanna Durbin, Robert Stack, and Eugene Pallette. An orphaned boarding school graduate secretly attends a prestigious ball, where she falls for the boyfriend of her snobbish cousin.", "datePublished": "1939-11-10", "keywords": "screwball comedy,cinderella,new york city,graduation,song", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 593, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031311/"}, "author": {"@type": "Person", "name": "SGriffin-6"}, "dateCreated": "2000-10-12", "inLanguage": "English", "name": "Sweet little musical, great for Durbin fans", "reviewBody": "\"First Love\" was a major transition for Universal star Deanna Durbin, as she was being positioned to shift from child star to engenue (something that Fox was inevitably unable to accomplish with Shirley Temple at the same time). While the film is not an overblown epic, it's lavish in the details, and carefully produced to give the whole piece a maximum of charm.  To today's audiences, it might be a bit saccharine, but if you can dial down the cynicism of our age, the film's positive points grow.\n\nDurbin plays much more subtly in this film than she had in many of her earlier films--signalling that she was now \"maturer\" instead of being a juvenile whirlwind ball of energy like she had been in \"Three Smart Girls\" and \"100 Men and a Girl.\"  Her beau, played by an impossibly young (and almost scarily good looking) Robert Stack, gives Durbin her first screen kiss--a source of major publicity for the film at the time.\n\nThe story is an updated Cinderella/screwball comedy, which nevertheless allows Durbin's character to break out into a few operatic arias throughout the film (this also takes some getting used to for modern audiences).  The most memorable part of the film, suitably, happens during \"the ball,\" where Durbin and Stack dance for the first time.  Employing a charming idea, a shot of a crowded dance floor dissolves to a shot of just the duo dancing, to imply how the pair are so involved with each other that the rest of the world has faded away.  If you like stuff like this, then you'll revel in the rest of the film."}, "duration": "PT1H24M"}