{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031122/", "name": "The Bronze Buckaroo", "image": "https://m.media-amazon.com/images/M/MV5BNjg1NDk0NTYwN15BMl5BanBnXkFtZTgwODQzMTkwMzE@._V1_.jpg", "genre": ["Action", "Adventure", "Music", "Mystery", "Romance", "Western"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0420370/", "name": "Herb Jeffries"}, {"@type": "Person", "url": "/name/nm0112122/", "name": "Lucius Brooks"}, {"@type": "Person", "url": "/name/nm0104734/", "name": "Artie Young"}, {"@type": "Person", "url": "/name/nm0588329/", "name": "F.E. Miller"}], "director": {"@type": "Person", "url": "/name/nm0434908/", "name": "Richard C. Kahn"}, "creator": [{"@type": "Person", "url": "/name/nm0434908/", "name": "Richard C. Kahn"}, {"@type": "Person", "url": "/name/nm0434908/", "name": "Richard C. Kahn"}, {"@type": "Organization", "url": "/company/co0150835/"}], "description": "The Bronze Buckaroo is a movie starring Herb Jeffries, Lucius Brooks, and Artie Young. Cowboy Bob Blake (Herbert Jeffries) and four friends ride to Arizona to help Betty Jackson (Artie Young), the sister of Bob's friend, Joe (Rollie...", "datePublished": "1939-01-01", "keywords": "black western,singing cowboy,bound and gagged,male tied up,brother sister relationship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 171, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031122/"}, "author": {"@type": "Person", "name": "MartinHafer"}, "dateCreated": "2013-10-02", "inLanguage": "English", "name": "Mildy interesting, it's still a bad film.", "reviewBody": "Back in the old days, movie theaters in the United States were often segregated or blacks had to go to different movie houses to see films. Not surprisingly, this led to black entrepreneurs deciding to make their own films--with black casts and film crew. Unfortunately, these films were plagued by horribly small budgets. Plus, many of these people simply weren't professionals...and in \"The Bronze Buckaroo\" it shows. Despite a decent performance by Herb Jeffries, the movie has so many strikes against it, today it's mostly of historical interest.\n\nThe film begins with Bob Blake (Jeffries) and his friends heading to the ranch of a friend, Joe Jackson. However, when they arrive, they learn from Jackson's sister that he's been missing for weeks. Soon, when some local thugs (led by Spencer Williams*) begin trying to stir up trouble, it's pretty certain these jerks are behind it. But who would kidnap Jackson and why? Well, it's up to Blake to handle it--pretty much by himself. In fact, in one rather dumb scene, he enters the headquarters of these guys and takes them on all by himself. Fortunately for realism sake, they soon beat the tar out of him! So is there anything I enjoyed about the film? Well, some of the comic relief did make me laugh--even though it was incredibly low-brow. One sharpie has learned ventriloquism and has convinced one of Blake's men that his mule can talk! Some might object to this, as it does tend to reinforce the notion of black inferiority to some viewers. Regardless, I laughed. On the other hand, I cannot ignore the terrible acting. Several of the 'actors' really had trouble reciting their lines (such as 'Uncle')--it was almost like watching a 3rd grade pageant, the acting was that bad.\n\n*Williams generally played heavies in the 30s and 40s. However, today he's known as Amos from the \"Amos 'n Andy\" television show.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "2"}}, "duration": "PT58M"}