{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0030732/", "name": "Service de Luxe", "image": "https://m.media-amazon.com/images/M/MV5BMTYxODA2NzIwOV5BMl5BanBnXkFtZTgwMjQ5Mzc0MjE@._V1_.jpg", "genre": "Comedy", "actor": [{"@type": "Person", "url": "/name/nm0000909/", "name": "Constance Bennett"}, {"@type": "Person", "url": "/name/nm0001637/", "name": "Vincent Price"}, {"@type": "Person", "url": "/name/nm0749476/", "name": "Charles Ruggles"}, {"@type": "Person", "url": "/name/nm0110813/", "name": "Helen Broderick"}], "director": {"@type": "Person", "url": "/name/nm0498174/", "name": "Rowland V. Lee"}, "creator": [{"@type": "Person", "url": "/name/nm0143837/", "name": "Vera Caspary"}, {"@type": "Person", "url": "/name/nm0543243/", "name": "Bruce Manning"}, {"@type": "Person", "url": "/name/nm0700717/", "name": "Gertrude Purcell"}, {"@type": "Person", "url": "/name/nm0818700/", "name": "Leonard Spigelgass"}, {"@type": "Organization", "url": "/company/co0005073/"}], "description": "Service de Luxe is a movie starring Constance Bennett, Vincent Price, and Charles Ruggles. The manager of a service agency for the wealthy clashes with - and falls for - an inventor who is seeking funding for a new kind of tractor.", "datePublished": "1939-02-20", "keywords": "psychotronic film", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 146, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0030732/"}, "author": {"@type": "Person", "name": "richardchatten"}, "dateCreated": "2017-08-08", "inLanguage": "English", "name": "Debut de Luxe", "reviewBody": "I've been aware of this film's existence since I was a teenager and after 45 years have finally caught up with it. 'Service de Luxe' is a competent assembly-line romantic comedy with Constance Bennett her usual glamorous blonde self bolstered by a vintage supporting cast (Helen Broderick is particularly good). That it is remembered today is due to its handsome young leading man fresh from Broadway snapped up by Universal.\n\nThe title will be familiar to his many admirers as the film debut of the 27 year-old Vincent Price, starting at the top playing a romantic lead in an 'A' feature opposite an established star. Already sporting the pencil-line moustache that was to come and go for the next twenty years, the young Vincent gracefully towers over the rest of the cast (even Mischa Auer!), moves comfortably in front of the camera and of course speaks in that wonderful purring baritone.\n\nPlaying a young inventor designing a new type of tractor, Vincent basically serves as eye candy for Connie Bennett and straight man to Charlie Ruggles and Mischa Auer. With odd exceptions, as when he attempts to discourage the amorous advances of Joy Hodges by telling her that madness runs in his family, we get little sense of just how deliriously funny he could later be in more eccentric roles, or how satanic a villain he would be; he would never play such a conventional lead again. Just two films later he was cast by this film's director, Rowland V. Lee, as the Duke of Clarence in 'Tower of London', in which he was murdered by Basil Rathbone and Boris Karloff and it was already clear that he was not destined to continue to play uncomplicated romantic leads. After signing up with Fox in 1940 he would kept busy for the next seven years in eye-catching supporting roles in big budget prestige productions. And the rest is history.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H25M"}