{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031619/", "name": "The Man in the Iron Mask", "image": "https://m.media-amazon.com/images/M/MV5BMGMyNmFlNmItNzJmYS00NmNiLWE0OTAtZWU0MGMxZTI2ODA0XkEyXkFqcGdeQXVyMTE2NzA0Ng@@._V1_.jpg", "genre": ["Adventure", "History", "Romance"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0371775/", "name": "Louis Hayward"}, {"@type": "Person", "url": "/name/nm0000910/", "name": "Joan Bennett"}, {"@type": "Person", "url": "/name/nm0929925/", "name": "Warren William"}, {"@type": "Person", "url": "/name/nm0771584/", "name": "Joseph Schildkraut"}], "director": {"@type": "Person", "url": "/name/nm0001843/", "name": "James Whale"}, "creator": [{"@type": "Person", "url": "/name/nm0241416/", "name": "Alexandre Dumas"}, {"@type": "Person", "url": "/name/nm0115482/", "name": "George Bruce"}, {"@type": "Organization", "url": "/company/co0134950/"}], "description": "The Man in the Iron Mask is a movie starring Louis Hayward, Joan Bennett, and Warren William. Despotic King Louis XIV discovers he has a twin brother who has grown up under the tutelage of his foster father, the patriotic musketeer...", "datePublished": "1939-07-13", "keywords": "frame up,psychotronic film,paris france,brother,musketeer", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1474, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031619/"}, "author": {"@type": "Person", "name": "dkncd"}, "dateCreated": "2007-10-20", "inLanguage": "English", "name": "A tale of twins", "reviewBody": "\"The Man in the Iron Mask\" is adapted from the volume by Alexander Dumas. The premise of the film is that King Louis XIV of France had an identical twin brother, who eventually becomes \"the man in the iron mask\". Also involved in the story are D'Artagnan and the Three Musketeers carried over from Dumas' novel \"The Three Musketeers\".\n\nLouis Hayward is equally excellent as the ineffectual King Louis XIV and his twin, the kindhearted Philippe. Joan Bennett is charming as Maria Theresa, slated to be Queen of France. Joseph Schildkraut is notable as the Machiavellian adviser Fouquet and Walter Kingsford also gives a commendable performance as rival adviser Colbert. Warren William gives the best performance of the Musketeers as the noble D'Artagnan, but the other Musketeers are well-portrayed.\n\nThis film features superb sets, scenes, costumes and a score to match. Some of the special effects work is noticeably dated, but is overall fine. The story is interesting and well-paced and doesn't suffer the slow patches that some other adventure films of the era do. It should be noted that this film features some action scenes, but viewers looking for a number of swordfights would probably do better with another film. The action scenes that were included were certainly well-made. Overall, \"The Man in the Iron Mask\" proves to be an interesting hypothetical story set in the time of Louis XIV.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H53M"}