{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031647/", "name": "Midnight", "image": "https://m.media-amazon.com/images/M/MV5BNzNiYmUzZDAtNmMwMy00ZGNmLWIzODMtMWRiZTJjYWVmN2I0XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_.jpg", "genre": ["Comedy", "Romance"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0001055/", "name": "Claudette Colbert"}, {"@type": "Person", "url": "/name/nm0000747/", "name": "Don Ameche"}, {"@type": "Person", "url": "/name/nm0000858/", "name": "John Barrymore"}, {"@type": "Person", "url": "/name/nm0496473/", "name": "Francis Lederer"}], "director": {"@type": "Person", "url": "/name/nm0500552/", "name": "Mitchell Leisen"}, "creator": [{"@type": "Person", "url": "/name/nm0102818/", "name": "Charles Brackett"}, {"@type": "Person", "url": "/name/nm0000697/", "name": "Billy Wilder"}, {"@type": "Person", "url": "/name/nm0562372/", "name": "Edwin Justus Mayer"}, {"@type": "Person", "url": "/name/nm0776456/", "name": "Franz Schulz"}, {"@type": "Organization", "url": "/company/co0023400/"}], "description": "Midnight is a movie starring Claudette Colbert, Don Ameche, and John Barrymore. A chorus girl stranded in Paris is set up by a millionaire to break up his wife's affair with another man, while being romantically pursued by a cab...", "datePublished": "1939-03-24", "keywords": "national film registry,taxi,taxi driver,party,screwball comedy", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 4374, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031647/"}, "author": {"@type": "Person", "name": "Doylenf"}, "dateCreated": "2006-11-29", "inLanguage": "English", "name": "Claudette Colbert and Don Ameche really shine in this screwball comedy...", "reviewBody": "Screwball comedy is an art and in '39 Charles Brackett wrote a perfectly wonderful one for CLAUDETTE COLBERT and DON AMECHE called MIDNIGHT and directed by the talented Mitchell Leisen.\n\nClaudette is down to her last coin when she stumbles out of a taxi-cab driven by Don Ameche and strolls around Paris in the pouring rain in a gold lame dress, not exactly the picture of a girl down on her luck. But the fun begins when she crashes a party given by a bunch of socialites and has to pretend to be there as a member of high society. She calls herself a Baroness and before long, Ameche has caught up with her and goes along with her impersonation, calling himself a Baron.\n\nOf course, it takes many plot twists and turns for the whole story to come to an end, and by that time there are quite a few laughs provided by Claudette and company. JOHN BARRYMORE is in especially good comic form as a man who wants his wife (MARY ASTOR) to get rid of her lounge lizard boyfriend (FRANCIS LEDERER), who happens to fancy Claudette. REX O'MALLEY has a fey role as a house guest and the cast includes HEDDA HOPPER and MONTY WOOLLEY as an exasperated and befuddled judge.\n\nClaudette has her best role since IT HAPPENED ONE NIGHT and makes the most of it. She schemes her way in and out of trouble with the disarming charm and ease of an actress who has worn many disguises before.\n\nSumming up: A very winning comedy that is a perfect example of screwball at its best.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H34M"}