{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031826/", "name": "The Private Lives of Elizabeth and Essex", "image": "https://m.media-amazon.com/images/M/MV5BMmYzN2Q1OTAtNTcwYy00ZGEyLWEyM2QtMTU5Njg2MjUwN2U2XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg", "genre": ["Biography", "Drama", "History", "Romance"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0000012/", "name": "Bette Davis"}, {"@type": "Person", "url": "/name/nm0001224/", "name": "Errol Flynn"}, {"@type": "Person", "url": "/name/nm0000014/", "name": "Olivia de Havilland"}, {"@type": "Person", "url": "/name/nm0187981/", "name": "Donald Crisp"}], "director": {"@type": "Person", "url": "/name/nm0002031/", "name": "Michael Curtiz"}, "creator": [{"@type": "Person", "url": "/name/nm0706993/", "name": "Norman Reilly Raine"}, {"@type": "Person", "url": "/name/nm0533418/", "name": "Æneas MacKenzie"}, {"@type": "Person", "url": "/name/nm0027173/", "name": "Maxwell Anderson"}, {"@type": "Organization", "url": "/company/co0002663/"}], "description": "The Private Lives of Elizabeth and Essex is a movie starring Bette Davis, Errol Flynn, and Olivia de Havilland. A depiction of the love/hate relationship between Queen Elizabeth I and Robert Devereux, the Earl of Essex.", "datePublished": "1939-11-11", "keywords": "queen,reference to shakespeare's richard ii,queen elizabeth i character,earl of essex character,francis bacon character", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 5031, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031826/"}, "author": {"@type": "Person", "name": "theowinthrop"}, "dateCreated": "2004-06-05", "inLanguage": "English", "name": "Played like a picolo!", "reviewBody": "There was a time, in the early 1920s and 1930s, that Maxwell Anderson was considered a great modern American dramatist.  His plays were considered the modern equivalent of Shakespeare or Marlowe or Jonson.  This was because he wrote in blank verse.  Many of his plays were turned into films, such as WINTERSET and MARY OF SCOTLAND. Even as late as the 1970s Brooks Atkinson (in his book BROADWAY) lauded Anderson to the skies.  \n\nIn retrospect, one wonders why the praise.  Probably because we have not produced many great serious dramatists.  I imagine that five names might be pushed at the present: O'Neill, Miller, Williams, Albee, and Inge.  Anderson is not revived.  His use of blank verse, so impressive to Atkinson, seems pretentious to us.  That and his stiff characterizations are major roadblocks to enjoying his work.\n\nBut he was flying high in 1939, when Warner Brothers purchased the film rights for ELIZABETH THE QUEEN for Bette Davis at Davis' urging.  But she wanted Lawrence Olivier for Essex, and was given Errol Flynn, an actor she did not like to work with.  Further, the title was changed (probably based on the Charles Laughton film THE PRIVATE LIFE OF HENRY VIII) to THE PRIVATE LIVES OF ELIZABETH AND ESSEX.  Actually the original title is better and it is as ELIZABETH THE QUEEN that the film is remembered.\n\nThe finished film is actually a good historical work - basically taking the story of Elizabeth I and her last favorite to it's tragic conclusion.  Flynn does capture the emotional instability of Essex, who chafed at being in his position of power only because he was the boy-toy of an aging, decrepit monarch.  The play/movie makes the affection of the two real, but the actual reality suggests that Essex was more of a male chauvenist than he dared show until the very end.  He was in contact with James VI of Scotland (the son of Elizabeth's dead rival Mary, Queen of Scots) about the coming change in regime.  This is not covered in the film (and to be fair, Essex's rival Robert Cecil (Henry Daniell) was also in contact with James VI).\n\nThe achilles heel of Essex is his desire for glory, and what is fascinating in the film is how everyone plays on his weakness. Elizabeth tries to protect him from his follies, by giving him a high ranking title to keep him in London.  But Cecil, his father Lord Burghley (Henry Stephenson), his rival Raleigh (Vincent Price) manage to goad him into leading an army in that permanent quagmire of Ireland. Finally his enemy Tyrone (Alan Hale Sr.) goads him (when he has been beaten) into returning to London and straightening out Elizabeth.  Essex does do so. In real history, his men were defeated in the streets of London.  In the film he does seize the palace, only to be manipulated by Elizabeth into disarming, and then is arrested for treason.  \n\nI don't think Elizabeth actually gave Essex a ring to return to her if he ever needed her help, but his death in 1601 on the headman's block at the Tower of London may have shortened her life.  She died in 1603, still Elizabeth the Queen, but also a sad, lonely old woman."}, "duration": "PT1H46M", "trailer": {"@type": "VideoObject", "name": "The Private Lives of Elizabeth And Essex", "embedUrl": "/video/imdb/vi1691354137", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTEyYjAxZTAtOWQ0ZC00OTAxLTg0MjYtYTgwZGNmOWIyNjg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTEyYjAxZTAtOWQ0ZC00OTAxLTg0MjYtYTgwZGNmOWIyNjg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for this turbulent story of England and Queen Elizabeth", "uploadDate": "2010-01-16T16:55:16Z"}}