{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031955/", "name": "Sorority House", "image": "https://m.media-amazon.com/images/M/MV5BZjk4YTI2ODUtY2M3OS00MDVlLThjYjEtMWMyZWU5MWFmZjU0XkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0794297/", "name": "Anne Shirley"}, {"@type": "Person", "url": "/name/nm0255199/", "name": "James Ellison"}, {"@type": "Person", "url": "/name/nm0713799/", "name": "Barbara Read"}, {"@type": "Person", "url": "/name/nm0086680/", "name": "Pamela Blake"}], "director": {"@type": "Person", "url": "/name/nm0268513/", "name": "John Farrow"}, "creator": [{"@type": "Person", "url": "/name/nm0874308/", "name": "Dalton Trumbo"}, {"@type": "Person", "url": "/name/nm0153808/", "name": "Mary Chase"}, {"@type": "Person", "url": "/name/nm0041141/", "name": "Gladys Atwater"}, {"@type": "Person", "url": "/name/nm0504054/", "name": "Aleen Leslie"}, {"@type": "Organization", "url": "/company/co0041421/"}], "description": "Sorority House is a movie starring Anne Shirley, James Ellison, and Barbara Read. Anne Shirley plays Alice Fisher-the daughter of a small grocer who at the last minute gets to go to little Talbot College. She learns that joining a...", "datePublished": "1939-05-05", "keywords": "sorority,roommate,grocer,male female relationship,university", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 177, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031955/"}, "author": {"@type": "Person", "name": "dougdoepke"}, "dateCreated": "2009-09-11", "inLanguage": "English", "name": "Class Struggle Comes to Sorority Row", "reviewBody": "Communist and later blacklisted screenwriter Dalton Trumbo gets a script assignment on sorority houses—the possibilities are intriguing and endless. After all, what better hothouse of class elitism is there than making sure your daughter or son meets just the right people and marries only within the proper social circles. Certainly, no Van der Bilt wants their offspring marrying a campus nobody, so why not manage their young lives through something like elitist clubs, otherwise known as sororities and fraternities. The topic seems perfect grist for an avowed enemy of class privilege, such as Trumbo is presumed to be.\n\nBut then the movie is a programmer, and the early Trumbo is a relative unknown, so conventional values do prevail. Nonetheless, dad Fisher delivers the main message at movie's end. Grief in the world, Dad observes, is caused by \"cliques\" banding together, whether sororities, clubs or nations, and then coming into conflict. And though Dad doesn't say so, cliques would presumably include the bogeyman of Marxist theory, economic class. Thus, as Trumbo's mouthpiece, Dad manages to come up with a social version of a classless society, which sounds more like choosing your own friends and not letting that go to your head than anything like common ownership of the means of production. It's also in keeping with the general spirit of the times, which exalts the virtues of the common man, especially salt-of- the-earth types like dad Fisher.\n\nThe movie itself is entertaining enough for a studio programmer, managing some gritty dramatics (the pushy aunt ruining Merle's pledge chances; the suicide attempt) and, of course, the expected sappy romance. But it's really Anne Shirley who shines and holds things together. Her friendliness comes across as so natural and unforced that you can't help but root for her. She's perfect as the unspoiled small town girl. Nonetheless, the movie remains very much a product of Hollywood and its time. \n\nIn passing—for a more revealing look at college sororities backed by of an A-budget, catch up with TCF's Take Care of My Little Girl (1952). In my little book, it's a real sleeper, despite the gloss."}, "duration": "PT1H4M"}