{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031149/", "name": "Charlie Chan in Reno", "image": "https://m.media-amazon.com/images/M/MV5BMTExMDVlZTctYTM5ZC00ZDQ2LTgxNDUtNWY5MTdiOTIwNDI3XkEyXkFqcGdeQXVyMzg2MzE2OTE@._V1_.jpg", "genre": ["Crime", "Drama", "Mystery", "Thriller"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0866010/", "name": "Sidney Toler"}, {"@type": "Person", "url": "/name/nm0007220/", "name": "Ricardo Cortez"}, {"@type": "Person", "url": "/name/nm0112198/", "name": "Phyllis Brooks"}, {"@type": "Person", "url": "/name/nm0838843/", "name": "Slim Summerville"}], "director": {"@type": "Person", "url": "/name/nm0287988/", "name": "Norman Foster"}, "creator": [{"@type": "Person", "url": "/name/nm0405081/", "name": "Frances Hyland"}, {"@type": "Person", "url": "/name/nm0712730/", "name": "Albert Ray"}, {"@type": "Person", "url": "/name/nm0448839/", "name": "Robert E. Kent"}, {"@type": "Person", "url": "/name/nm0943804/", "name": "Philip Wylie"}, {"@type": "Person", "url": "/name/nm0081788/", "name": "Earl Derr Biggers"}, {"@type": "Organization", "url": "/company/co0000756/"}], "description": "Charlie Chan in Reno is a movie starring Sidney Toler, Ricardo Cortez, and Phyllis Brooks. Mary Whitman, an old friend of Charlie's in Reno for a divorce, finds herself accused of murdering the woman her husband planned to marry...", "datePublished": "1939-06-16", "keywords": "roulette,craps,charlie chan character,four word title,1930s", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1282, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031149/"}, "author": {"@type": "Person", "name": "csteidler"}, "dateCreated": "2012-07-08", "inLanguage": "English", "name": "Great assembly of B movie actors in top-notch mystery", "reviewBody": "Sweet but sorrowful Pauline Moore arrives in Reno for her divorce. At the hotel she quickly meets Ricardo Cortez, suave doctor, and Phyllis Brooks, a kind of \"social director\" at the hotel, who urges her into the lounge for a drink. Also on the scene are Robert Lowery, earnest young socialite, and Kay Linaker, a more serious-minded guest—and the vulgar and tipsy Louise Henry, the would-be future husband of Moore's current spouse, who manages to insult all of the other characters within the space of about two minutes. Not surprisingly\u0085.\n\nThe nasty woman is shortly thereafter found murdered in her room. Pauline Moore is—unfortunately for her—found standing over the still-warm body; on the plus side for Moore, however, is her old friendship with the great Charlie Chan—who on hearing of her arrest immediately drops everything in Honolulu (he has been working in the police lab on an Easter egg) and flies over to Nevada to assist. He is accompanied by Kane Richmond, Moore's estranged—yet basically solid—husband.\n\nIt's a nice ensemble cast, a good mix of suspects. Keeping an eye on them all is Sheriff Slim Summerville, who goes by the name of \"Tombstone,\" is suspicious of everyone, and is pretty much clueless. He is good comic relief, as is— \n\nSen Yung, back as Jimmy Chan, now a student at USC who borrows a car and sets out for Reno when he gets word that there's a case on. Along the highway, he gets highjacked and loses his car and his clothes\u0085.And one of the funniest scenes in the Chan series has got to be the moment when Jimmy, picked up by the cops, walks out under the lights in a police lineup wrapped in a blanket—and his recently-arrived pop is in the audience with the Reno chief.\n\nOnce released, Jimmy has a cute romance with hotel maid Iris Wong. \"Does honorable father think you're too young to smoke?\" she asks as he (amateurishly) lights up a cigarette. \"Oh no, I'm no kid,\" Jimmy insists. \"I help him solve his cases.\" Of course, he has a few ideas on this case as well\u0085.\n\nSidney Toler is fine at the center of it all, bantering with suspects, flattering the sheriff, tut-tutting Jimmy. Eventually, he gathers all of the suspects together for a climactic scene that is quite suspenseful and nicely satisfying.\n\nVery enjoyable. It may be a formulaic series entry—but at this point they sure had the formula down right.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H11M"}