{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031397/", "name": "Gulliver's Travels", "image": "https://m.media-amazon.com/images/M/MV5BNWIyOTBjMWQtNWQ2Zi00MTcxLTk1NjYtODFlNjc5NDAzMDVmXkEyXkFqcGdeQXVyNTkxMzEwMzU@._V1_.jpg", "genre": ["Animation", "Adventure", "Comedy", "Family", "Fantasy", "Musical", "Romance"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0236756/", "name": "Jessica Dragonette"}, {"@type": "Person", "url": "/name/nm0743595/", "name": "Lanny Ross"}, {"@type": "Person", "url": "/name/nm0173416/", "name": "Pinto Colvig"}, {"@type": "Person", "url": "/name/nm0397175/", "name": "Cal Howard"}], "director": [{"@type": "Person", "url": "/name/nm0281487/", "name": "Dave Fleischer"}, {"@type": "Person", "url": "/name/nm0101466/", "name": "Willard Bowsky"}, {"@type": "Person", "url": "/name/nm0130725/", "name": "Orestes Calpini"}, {"@type": "Person", "url": "/name/nm0186276/", "name": "Roland Crandall"}, {"@type": "Person", "url": "/name/nm0377431/", "name": "William Henning"}, {"@type": "Person", "url": "/name/nm0396043/", "name": "Winfield Hoskins"}, {"@type": "Person", "url": "/name/nm0426322/", "name": "Thomas Johnson"}, {"@type": "Person", "url": "/name/nm0446041/", "name": "Frank Kelling"}, {"@type": "Person", "url": "/name/nm0460667/", "name": "Seymour Kneitel"}, {"@type": "Person", "url": "/name/nm0498984/", "name": "Robert G. Leffingwell"}, {"@type": "Person", "url": "/name/nm0622451/", "name": "Grim Natwick"}, {"@type": "Person", "url": "/name/nm0658476/", "name": "Tom Palmer"}], "creator": [{"@type": "Person", "url": "/name/nm0842605/", "name": "Jonathan Swift"}, {"@type": "Person", "url": "/name/nm0786545/", "name": "Edmond Seward"}, {"@type": "Person", "url": "/name/nm0330106/", "name": "Dan Gordon"}, {"@type": "Person", "url": "/name/nm0397175/", "name": "Cal Howard"}, {"@type": "Person", "url": "/name/nm0682481/", "name": "Tedd Pierce"}, {"@type": "Person", "url": "/name/nm0816917/", "name": "Izzy Sparber"}, {"@type": "Person", "url": "/name/nm0786545/", "name": "Edmond Seward"}, {"@type": "Organization", "url": "/company/co0130483/"}], "description": "Gulliver's Travels is a movie starring Jessica Dragonette, Lanny Ross, and Pinto Colvig. A doctor washes ashore on an island inhabited by little people.", "datePublished": "1939-12-22", "keywords": "cult film,1930s,18th century,gulliver,lilliput", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3866, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031397/"}, "author": {"@type": "Person", "name": "ElMaruecan82"}, "dateCreated": "2013-06-26", "inLanguage": "English", "name": "More than a 'wannabe Disney' ...", "reviewBody": "\"Gulliver's Travels\" was the second animated movie in Cinema's history, released only two years after Disney's milestone \"Snow White and the Seven Dwarfs\" and right before the no-less iconic \"Fantasia\", \"Pinocchio\", \"Dumbo\" and \"Bambi\". It's easy to tell that the film was meant to counterattack Disney's growing control on the world of animation\u0085 and even easier to guess that it failed, overpowered by the mastery and incomparable magic reached by the Disney studios.\n\nDisney pushed the edge of the envelope so far, making \"Gulliver's Travels\" suffering from any comparison. Yet it would be very unfair to label the film as a wannabe Disney and let random trivia affect an opinion toward a film mostly made for children. My guess is whether for \"Gulliver's Travels\", \"All Dogs Go to Heaven\" or \"Time Before Land\", children wouldn't care much about the logo introducing the film or any technical consideration, no more anyway than the on-screen experience carried by the story, the images, the songs and naturally, the characters. On that level, \"Gulliver's Travels\" provides all the ingredients of the best animated classics, and it's a great entertainment for children.\n\nNow, allow me to wake up my inner child, the little one who saw the film for the first time on a crappy VHS and after that, during a nice Saturday in my uncle's home. Coincidentally, the same year, I read a comic-book involving another character who, after a stormy night, found himself on an island inhabited by little people. It was enough for me to believe that any person washed up on an island would become a giant. In my child's imagination, it had to do with drinking too much water or something like that. Pretty crazy, isn't it? But that's the way I looked at Gulliver and never thought the Lilliputians were meant to be 'little people'. Needless to say it didn't change the film's over-all effect.\n\nI remember I also loved the cute scene-stealing Gabby, the town crier, voiced by Pinto Colvig (Goofy's voice for the experts) who through his exuberance, seemed to embody the most endearing traits of the seven dwarfs. His desperate attempt to tell the Lilliputians that \"there is a giant in the beach\" was my favorite part, closely followed by Gulliver's struggle to get rid of the ropes fixing him on the wooden platform, quite impressive for its physical realism. And when I saw the film again, a few years ago, as soon as Gabby started to shout \"All's Well\", the whole music resurrected in my mind, and I could whistle the tune all the way. As for Gulliver's first stand, I understood why I was so intimidated by his look as a kid when I learned he was animated by rotoscoping, a process involving tracing live-action forage frame by frame, probably one of the film's strengths, proving that it wasn't trying to imitate Disney.\n\nIndeed, the rotoscoping creates the perfect distinction between Gulliver and the Lilliputians, and from my adult's second viewing, I remember I was in awe when I saw Gulliver's expression, noticing the screams of Gabby in the castle's dungeon and his bewildered eyes when he realized it was a little man, not to mention his suave and low-pitched voice, that's animation at best, and it's still strange that Disney never thought of that process. Disney improved the drawing of human features with time, making rotoscoping useless, but within the context of \"Gulliver's Travels\", it gives the film a touch of modernity that slightly surpasses \"Snow White and the Seven Dwarfs\". It also highlights one of the film's unavoidable flaws, the design of Prince David and Princess Glory, who're the only 'little creatures' that don't look comical, but still feel like archetypes of the handsome prince and beautiful princess.\n\nHowever, the film doesn't overuse the two lovers from rival islands and the two annoyingly cute little birds who seemed to be borrowed from the 'other studio', but cleverly uses them as the hostages of their islands' enmity, even more unbelievable since it started on a disagreement over the songs to perform at the wedding : \"Faithful\" or \"Forever\", not as memorable as \"Some Day, My Prince Will Come\" or even the catchy \"All's Well\" or \"It's a Hap-Hap-Happy Day\" that became standards of Paramount studios, but performed together, they give the film the typical classic touch, deserving their Oscar nomination for Best song. At the end, children have the songs, comic reliefs with Gabby and the three spies, and Gulliver has quite an authoritarian presence and a hidden charisma that perfectly contrast with the other characters and contradicts the golden rule of a memorable villain, established by Disney. Who needs a villain with such a larger-than-life hero \u0085 literally.\n\nNow, it's easy to let cynicism cloud the appreciation of the film. Some can picture the Fleisher executives telling their animators \"Listen, guys, we didn't want to make a film, but Disney proved it could work, so let's make our 'Snow White'\". Then, the classic tale of Gulliver from Jonathan Swift, allows them to use similar plot devices such as a realistic person surrounded by goofy little characters, a romance, cute animals, and nice songs. But despite these similarities, \"Gulliver's Travels\" stands as a classic on its own, and comparing to \"Snow White\" is like comparing between \"Bambi\" and \"The Lion's King\". And again, would children really do such comparisons? \n\n\"Gulliver's Travels\" deserves in my opinion, the term of an animated classic, even by Disney standards. Granted it doesn't have the status of Disney movies from the era, nor a brighter palette of colors, something that can even be pointed out by a kid, but the second animated feature of all time, the first from a non-Disney studio deserves some credit for its nice attempt to compete with the Goliath of animation. And as far as I am concerned, within its own simplicity, all's well in \"Gulliver's Travels\".", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H16M"}