{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031863/", "name": "Rio", "image": "https://m.media-amazon.com/images/M/MV5BZjJiODNiOGEtZmQ0ZS00OWNiLThjN2MtOWZiZmZkNmJhNDA1XkEyXkFqcGdeQXVyMzc5ODc1MDY@._V1_.jpg", "genre": ["Crime", "Drama", "Romance"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0001651/", "name": "Basil Rathbone"}, {"@type": "Person", "url": "/name/nm0572142/", "name": "Victor McLaglen"}, {"@type": "Person", "url": "/name/nm0348619/", "name": "Sigrid Gurie"}, {"@type": "Person", "url": "/name/nm0191950/", "name": "Robert Cummings"}], "director": {"@type": "Person", "url": "/name/nm0103975/", "name": "John Brahm"}, "creator": [{"@type": "Person", "url": "/name/nm0437189/", "name": "Aben Kandel"}, {"@type": "Person", "url": "/name/nm0562372/", "name": "Edwin Justus Mayer"}, {"@type": "Person", "url": "/name/nm0664022/", "name": "Frank Partos"}, {"@type": "Person", "url": "/name/nm0043081/", "name": "Stephen Morehouse Avery"}, {"@type": "Person", "url": "/name/nm0624535/", "name": "Jean Negulesco"}, {"@type": "Organization", "url": "/company/co0005073/"}], "description": "Rio is a movie starring Basil Rathbone, Victor McLaglen, and Sigrid Gurie. A crazed man escapes from prison to kill his wife's lover.", "datePublished": "1939-09-29", "keywords": "tension,stress,grief,deception,damsel in distress", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 79, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031863/"}, "author": {"@type": "Person", "name": "melvelvit-1"}, "dateCreated": "2010-12-22", "inLanguage": "English", "name": "An oddball Universal \"A\" and possible \"proto-noir\"", "reviewBody": "A Parisian swindler (Basil Rathbone) sentenced to Devil's Island eventually escapes to find his wife (Goldwyn Edsel Sigrid Gurie) has fallen in love with another man (Robert Cummings)...\n\nThe year 1939 is considered a high water mark in Golden Age Hollywood's studio era but RIO is a movie I doubt we'll hear much about in the future (godknows, I never did in the past). It's an odd-ball Universal \"A\" with a \"name\" cast (Basil Rathbone, Victor McLaglen, Robert Cummings, Leo Carillo, Billy Gilbert, and, at the time, Sigrid Gurie) and probably a \"programmer\" (a movie shown as the bottom half of a double-bill in big theaters and by itself in smaller venues) that came and went rather quickly. The IMDb labels it \"film noir\" but it's not -not that I could see, anyway. If anything, it's quite possibly a \"proto-noir\" but that's only because of the director, German émigré John Brahm (THE LODGER, HANGOVER SQUARE, THE LOCKET) and the fact the protagonist is an \"anti-hero\", something unusual for movies in 1939. Rathbone's the star -it's his adventures we're following- and being France's answer to Bernie Madoff and a cold-blooded murderer made him no less likable. Basil was right at home as a French fancy pants but making with the beefcake was pushing it a bit, especially when stripped to the waist on a chain gang or making a daring escape through the swamps. The setting was quite ambitious (Paris, Devil's Island, various nightclubs, the South American jungle, Rio during Carnivale) and nicely realized, considering, but those four songs were there, no doubt, to pad it out -or promote Sigrid Gurie, who warbled three of them (which was two too many if you ask me). Siggie was launched the year before by Samuel Goldwyn as \"The Norwegian Garbo\" when he starred her in THE ADVENTURES OF MARCO POLO and if her talents had been more than modest, it probably wouldn't have mattered when the press later found out she was born in Brooklyn -but it did and she faded fairly quickly. I'd give it a \"recommended if it's not going out of your way\" -provided it ever pops up anywhere.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H17M"}