{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031173/", "name": "Confessions of a Nazi Spy", "image": "https://m.media-amazon.com/images/M/MV5BYTIxNWY0ZTItMGYwMC00NzY2LTk5NzktYmQzNjlmMzEzZDc5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg", "genre": ["Drama", "War"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0000064/", "name": "Edward G. Robinson"}, {"@type": "Person", "url": "/name/nm0001695/", "name": "George Sanders"}, {"@type": "Person", "url": "/name/nm0496473/", "name": "Francis Lederer"}, {"@type": "Person", "url": "/name/nm0510134/", "name": "Paul Lukas"}], "director": {"@type": "Person", "url": "/name/nm0514822/", "name": "Anatole Litvak"}, "creator": [{"@type": "Person", "url": "/name/nm0471341/", "name": "Milton Krims"}, {"@type": "Person", "url": "/name/nm0923333/", "name": "John Wexley"}, {"@type": "Person", "url": "/name/nm0878103/", "name": "Leon G. Turrou"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0041460/"}], "description": "Confessions of a Nazi Spy is a movie starring Edward G. Robinson, George Sanders, and Francis Lederer. FBI agent Ed Renard investigates the pre-War espionage activities of the German-American Bund.", "datePublished": "1939-05-06", "keywords": "nazi menace,nazi agent,nazi spy,german american,spy network", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1449, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031173/"}, "author": {"@type": "Person", "name": "deschreiber"}, "dateCreated": "2013-01-30", "inLanguage": "English", "name": "good period piece", "reviewBody": "Based on a series of articles, then a book, \"Nazi Spies in America,\" by ex-F.B.I agent Leo Turrou, who lost his job for writing, this is an interesting period piece. The dialogue has its clunky moments, especially when characters pause to speechify. But that was probably necessary as part of the propaganda of the time, when it was important to wake up America to the dangers of Nazism before Pearl Harbor. It was a time when too many voices were saying Hitler's was a European war and that America should keep out of it, and pro-Nazis like Charles Lindberg and the radio priest, Father Charles Coughlin, drew large audiences. \n\nAlthough there certainly were Nazi spies in the U.S., resulting in numerous convictions, at the same time it's worth noting that the direct threat to America was exaggerated in the film. In 1939-1940 Hitler was focused on continental Europe first, then Britain, and had spent little time thinking about America. But the existence of Nazi spies certainly justified setting off alarm bells across the country and an effort to determine just how serious the threat was. Again, the film's value is largely as a period piece.\n\nI do fault the script for portraying the spies as confessing and switching sides much too easily. Those moments struck me as highly unrealistic.\n\nThe website of the FBI describes the spy cases on which the articles, book and film were based. The case of Guenther Rumrich, who attempted to obtain 50 blank passports by posing as the Secretary of State is described at http://1.usa.gov/SbtCWj, although the FBI describe him as \"crafty\" while in the film he appears as a fool. The FBI also admits its failure in the case, reporting that \"four times as many spies had escaped, including the biggest fishes.\" Leon Turrou, the ex-agent who wrote the book on which \"Confessions of a Nazi Spy\" was based, fares very badly in the FBI account. Another case related to the movies was the Duquesne Spy Ring, involving 33 spies, described by the FBI at http://1.usa.gov/TcR74V.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H44M"}