{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031442/", "name": "Honolulu", "image": "https://m.media-amazon.com/images/M/MV5BOThiZWNjMzEtODgyNy00M2MxLWE3YTctNGIwM2QxYmM3Y2Y5XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg", "genre": ["Comedy", "Musical", "Romance"], "contentRating": "Passed", "actor": [{"@type": "Person", "url": "/name/nm0007224/", "name": "Eleanor Powell"}, {"@type": "Person", "url": "/name/nm0001870/", "name": "Robert Young"}, {"@type": "Person", "url": "/name/nm0122675/", "name": "George Burns"}, {"@type": "Person", "url": "/name/nm0020555/", "name": "Gracie Allen"}], "director": {"@type": "Person", "url": "/name/nm0125636/", "name": "Edward Buzzell"}, "creator": [{"@type": "Person", "url": "/name/nm0276252/", "name": "Herbert Fields"}, {"@type": "Person", "url": "/name/nm0664022/", "name": "Frank Partos"}, {"@type": "Person", "url": "/name/nm0649183/", "name": "George Oppenheimer"}, {"@type": "Person", "url": "/name/nm0750822/", "name": "Harry Ruskin"}, {"@type": "Organization", "url": "/company/co0007143/"}], "description": "Honolulu is a movie starring Eleanor Powell, Robert Young, and George Burns. Wanting a break from his overzealous fans, a famous movie star hires a Hawaiian plantation owner to switch places with him for a few weeks.", "datePublished": "1939-02-03", "keywords": "tap dancing,pearl necklace,rum,vacation,hawaii", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 544, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031442/"}, "author": {"@type": "Person", "name": "TheLittleSongbird"}, "dateCreated": "2014-09-16", "inLanguage": "English", "name": "Not a great film but a pleasant way to pass the time", "reviewBody": "Honolulu's not perfect (in my opinion), starting with a rather ridiculous story with a tired scenario that can get confusingly told in places. It was unevenly paced, some parts were fine, others were rushed and others were pedestrian. George Burns doesn't really have a lot to do and was a touch bland, and his chemistry with Gracie Allen while pleasant could have shone more if they were on screen longer together, Allen's chemistry with Eleanor Powell fares much better. Honolulu is still a pleasant film though, that is not among the best film musicals but a long way from the worst. The score is lush and while the songs are not the most memorable set of songs from a musical they are still very good and well-placed, the title song, the Hawaiian Medley and The Leader Doesn't Like Music particularly good. Honolulu does have some witty dialogue, with Robert Young having some lovely comic moments, and the shipboard costume party was a lot of fun especially to see what the characters dressed up as. Terrific also was the choreography, the best being the hula dance(you'd be hard pressed to find a sexier one on film), Powell's homage to Bill \"Bojangles\" Robinson and the tap/skipping-rope routine, the last one possibly being the most complicated- a lot of people would find it impossible to do- but danced effortlessly by Powell. And despite the black-face in the Robinson homage causing alarm bells for some who are yet to see it there is nothing really offensive here, although the rather stereotypical and out of place Chinese valet character played by William Fung will not work for some. The direction is pedestrian at times in the non-musical scenes but is very efficient mostly while the performances are good too, Gracie Allen is adorable and very funny and Robert Young is charming and quite gifted in comedy. But Honolulu is Eleanor Powell's film, she radiates the screen and generates warmth and ease, plus her dancing is just incredible (easily among the best dancers on film). Overall, not great but pleasant entertainment. 6/10 Bethany Cox", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H23M"}