{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0031143/", "name": "The Cat and the Canary", "image": "https://m.media-amazon.com/images/M/MV5BYjU2N2E1NGYtYTMxZC00OWNmLTk2ZjMtMjIwNTNjNmUxMGZhXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg", "genre": ["Comedy", "Horror", "Mystery", "Thriller"], "contentRating": "Approved", "actor": [{"@type": "Person", "url": "/name/nm0001362/", "name": "Bob Hope"}, {"@type": "Person", "url": "/name/nm0002104/", "name": "Paulette Goddard"}, {"@type": "Person", "url": "/name/nm0063619/", "name": "John Beal"}, {"@type": "Person", "url": "/name/nm0599766/", "name": "Douglass Montgomery"}], "director": {"@type": "Person", "url": "/name/nm0637790/", "name": "Elliott Nugent"}, "creator": [{"@type": "Person", "url": "/name/nm0216755/", "name": "Walter DeLeon"}, {"@type": "Person", "url": "/name/nm0823395/", "name": "Lynn Starling"}, {"@type": "Person", "url": "/name/nm0929616/", "name": "John Willard"}, {"@type": "Organization", "url": "/company/co0023400/"}], "description": "The Cat and the Canary is a movie starring Bob Hope, Paulette Goddard, and John Beal. When an eccentric family meets in their uncle's remote, decaying mansion on the tenth anniversary of his death for the reading of his will, murder...", "datePublished": "1939-11-10", "keywords": "louisiana bayou,tenth anniversary,eavesdropping,hiding in a closet,black cat", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 2677, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0031143/"}, "author": {"@type": "Person", "name": "bkoganbing"}, "dateCreated": "2012-08-11", "inLanguage": "English", "name": "Another Millionaire leaves a wacky will", "reviewBody": "The late Uncle Cyrus left quite a collection of greedy relatives looking to be the number one heir at the reading of his will at his home on an island in the Louisiana bayou swamp. Among the possible legatees are Bob Hope, Paulette Goddard, John Beal, Douglass Montgomery, Elizabeth Patterson, Nydia Westman and housekeeper Gale Sondergaard. Presiding over the reading of the will is lawyer George Zucco. Besides Bob Hope a lot of the names of the cast spell out sinister.\n\nAs usual the deceased always makes out a will with wacky provisions. Winner of the prize is Goddard, but she has to spend some time at the creepy mansion, essential in these kind of films. And if she's driven to madness or killed there is a secret provision for a second heir among the crew that only Zucco knows. \n\nThe Cat And The Canary is a nice blend of both comedy and melodrama with of course Hope in charge of the comedy. He's a successful radio star as in real life at that time and Uncle Cyrus's money while nice isn't going to be the difference in where his next meal is coming from. And he's liking what he sees in Goddard so he's protective of her in his own comedic way.\n\nThis was the first of three films that Hope and Goddard did. Immediately afterward Paramount put them in The Ghostbreakers which certainly had some similar themes. They worked well together too bad they were not able to collaborate more.\n\nThis was a nice film for the career of Bob Hope which was zooming into high gear right about now.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H12M"}